{
  "account": {
    "id": "1275260909896769538",
    "screen_name": "DrProfitCrypto",
    "name": "Doctor Profit 🇨🇭",
    "description": "Elite trader, master of x100 I trade psychology, $BTC and Stocks| Educational content only. NO FINANCIAL ADVICE Join Premium: https://t.co/TvHxOtKhHj",
    "profile_image_url": "https://pbs.twimg.com/profile_images/1868283617241190401/jqSya1td_normal.jpg",
    "profile_banner_url": "https://pbs.twimg.com/profile_banners/1275260909896769538/1728171341",
    "followers_count": 436301,
    "friends_count": 685,
    "statuses_count": 11164,
    "favourites_count": 8995,
    "listed_count": 3150,
    "location": "DM for VIP membership",
    "website": "https://t.co/WAXkjQ1Akk",
    "birthdate": null,
    "verified_type": null,
    "is_blue_verified": true,
    "following": true,
    "followed_by": null,
    "can_dm": true,
    "protected": false,
    "created_at": "2020-06-23 10:54:39 +08:00",
    "url": "https://twitter.com/DrProfitCrypto",
    "rest_id": "1275260909896769538"
  },
  "tweets": [
    {
      "id": "1846138647432560875#m",
      "content": "Join Premium and access 5 channels:\n\n1. 𝐃𝐫.𝐏𝐫𝐨𝐟𝐢𝐭 | 𝑽𝑰𝑷 🌹\n2.𝑨𝒄𝒕𝒊𝒗𝒆 𝑻𝒓𝒂𝒅𝒆𝒔 🔥\n3. 𝐃𝐫.𝐏𝐫𝐨𝐟𝐢𝐭 | 𝑪𝒉𝒂𝒕 💬\n4. 𝑳𝒐𝒏𝒈 𝑻𝒆𝒓𝒎 𝑰𝒏𝒗𝒆𝒔𝒕𝒎𝒆𝒏𝒕𝒔 💹\n5.𝑫𝒖𝒃𝒂𝒊 𝑹𝒆𝒂𝒍 𝑬𝒔𝒕𝒂𝒕𝒆 🏙️\n\nJoin here and get direct access: whop.com/drprofit-trading/",
      "timestamp": "Oct 15, 2024 · 10:38 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1846138647432560875#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1980167183809614053#m",
      "content": "ChainLink is sitting with the most powerful institutions on earth during tomorrows public “Payments Innovation Conference” hosted by the FED! BlackRock, Coinbase, Stripe, and Circle. But among all crypto projects $LINK is going to attend, I am not ignoring this",
      "timestamp": "Oct 20, 2025 · 7:00 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1980167183809614053#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1980151344955539857#m",
      "content": "🚨 BULLS GETTING FOOLED ONCE AGAIN!\n\nThis chart tells you how market makers are liquidating bulls and bears in the current bear market! Nothing goes down in a straight candle! We are in a bear market, but respect short term moves, as high leverage traders needs to be wiped out on both sides before the next big downside move!\n\nEvery short-term bounce is designed to fool bulls and liquidate late bears. The next plan of the market makers is to send BTC to the 116.5k region in order to liquidate late bears and generate more than enough liquidity to send the price down again to new local lows. We will see these moves repeated over and over again in the next weeks and months. Sadly, many don’t understand this and believe that I am turning bullish when I say I’m expecting 116k for manipulation purposes, while the manipulation serves only the bears and my own shorts. Education is important",
      "timestamp": "Oct 20, 2025 · 5:57 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1980151344955539857#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1980126858894008790#m",
      "content": "#Bitcoin: In Yesterday's Sunday report I spoke about the max greed in the markets by bulls and bears, and bears that entered into late shorts recently! Most of their liquidations are in 116,500 region! Its likely to visit as mentioned yesterday before continue going down!",
      "timestamp": "Oct 20, 2025 · 4:20 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1980126858894008790#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1980120061655347644#m",
      "content": "There is a high probability to visit $116,500 region\n\nAs mentioned yesterday in the Sunday Report\n\nPlaced several short orders in $116,500 region",
      "timestamp": "Oct 20, 2025 · 3:53 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1980120061655347644#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1980114264234074320#m",
      "content": "#Bitcoin went from $15,000 → $125,000 in three years, showing a +700% gain. And yet some still say “the bull market hasn’t started.” Greedy and delusional bulls are once again wrong! History repeats: 3 bullish years → 1 bearish year. Always has. Always will",
      "timestamp": "Oct 20, 2025 · 3:30 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1980114264234074320#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979846182890258694#m",
      "content": "#Bitcoin/ Stock market – What’s Next?\n\nThe Big Sunday Report: All You Need to Know\n\n🚩 TA / LCA / Psychological Breakdown:\n\nSince end of August I am warning that the top territory is an area to add shorts and sell. Everyone who listened to me understood by now that 115-125k was indeed a great region to add shorts and sell, with an average short entry of 119k and hitting the top of 125k as predicted. So what is next? Markets remain extremely bearish as we are currently in the process of playing the bearish divergence forming since August. We need to understand that this market is driven by greed, currently I have rarely seen so much greed in the market as now, and I am speaking about both the bear and bullish side. Bulls that have been greedy to sell at good prices, and bears that are now euphoric as they know what’s coming next. While I am a big supporter of the bearish case, market makers tend to punish both sides of the market before making any important move. So just to have a quick recap, in August and September BTC visited our short and sell area region between 115-125k, while bulls were greedy, calling for higher, I have called to start building short positions in these regions. BTC went to 126k, 1k more than my max top scenario of 125k and we saw the historic dump in October. Now and in the recent days many bears joined the party late. These bears caused tons of liquidations in the region of 116.5k. While the region of our short entry is far from these short liquidations, the recent bears are in danger of seeing a liquidation event before continuing to the downside. I also see many people saying that there are tons of liquidations between the 120-130k region which is simply not true. I don’t know where your data is from but as per my data there is a very low amount of liquidity, given the fact that during 120-125k almost everyone was bullish and very few people besides me really entered into a short position. So given this in contrast, will the market makers allow retail and whales to exit at a better price after already making them lose? I doubt it, so I see the max bullish scenario at the 116,500 region if the market allows to visit, which is an increase of 9% from this point as a MAX BULLISH scenario. In case the market allows to visit this region, I am more than happy to have placed many short orders in that region waiting to be triggered as the main move is to the downside.\n\nIts very important to mention that by breaking below $101,700 Bitcoin will break below its magic bull market line which would finally confirm a bear market and silence those bulls once for all! So have patience, because the move to send BTC below this magic line will be massive! Prepare for it, and dont be a fool! I predict a breakdown below this magic line and the end of the bull market!\n\nOn top of that we also see the 112,500 short term holder realized price, which shows the average entry of short term traders and buyers. This means that those short term traders are now in a loss, and as per on-chain data they tend to sell most of their positions if prices fall down between 5-10%, adding more short term pressure to the market. Keep this as side information as more sell pressure ahead.\n\nAs per the calendar CPI data is to be published on Friday with 0.3% expectations. I can repeat my words all over again but DrProfit Premium on Telegram nailed all of these moves. None of our members that listened to DrProfit ended up liquidated in the largest liquidation event in history, no, they shorted the largest liquidation event in history and made life changing gains. I can’t repeat it more often but joining DrProfit Premium can truly change your life as many testimonies are showing. Join here: whop.com/drprofit-trading/dr…\n\nTrade with DrProfit on BloFin: blofin.com/invite/DrProfitCr…\n\nTHIS IS NOT FINANCIAL ADVICE BUT EDUCATIONAL CONTENT ONLY. ALL WRITTEN HERE IS MY OPINION AND MY OWN TRADING AND INVESTING STRATEGY.",
      "timestamp": "Oct 19, 2025 · 9:44 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979846182890258694#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979809880480563405#m",
      "content": "Who wants Sunday report?",
      "timestamp": "Oct 19, 2025 · 7:20 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979809880480563405#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979408777443983570#m",
      "content": "🚨#BTC: 10 YEAR FRACTAL CONFIRMS BEAR\n\nFrom 2015 ATL to ATH BTC took 1050 Days\n\nFrom 2017 ATH to ATL it took 364 Days\n\nFrom 2018 ATL to ATH it took 1071 Days\n\nFrom 2021 ATH to ATL it took 364 Days\n\nNow BTC is up 1064 days from All time low to current ATH. If we follow the same fractal we are entering a bear market in this month and will bottom out in October 2026. (This chart was shared in the premium channel two weeks ago at an BTC price of 124k)",
      "timestamp": "Oct 18, 2025 · 4:46 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979408777443983570#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979399856427831655#m",
      "content": "Stock market insiders continue to dump heavily, I pointed this out since September, a pattern that usually matches before strong downside moves. Alone in the last three weeks NVIDIA CEO dumped $250M worth of NVIDIA shares on retails that are buying right into the top",
      "timestamp": "Oct 18, 2025 · 4:11 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979399856427831655#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979397565574455533#m",
      "content": "There is nothing to remain bullish in this market\n\nI shared this plan at the exact 125k top\n\nWe are in a bear market, next months bloody!",
      "timestamp": "Oct 18, 2025 · 4:02 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979397565574455533#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979096494415184370#m",
      "content": "People believe bear markets are easy\n\nIn 2022 bear SOL went from $250 to $8\n\nYou need a x32 increase for break even!\n\nMost of coins never ever recover!\n\nThis bear will break many people!",
      "timestamp": "Oct 17, 2025 · 8:05 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979096494415184370#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979091620571287608#m",
      "content": "There is a difference in being wrong, and mocking others while being wrong. I respect every trader but those who disrespected my bearish opinion in the last two months are now fully silent. Will they ever apologize?",
      "timestamp": "Oct 17, 2025 · 7:46 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979091620571287608#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979082901229641848#m",
      "content": "I said BTC goes below 100k in September\n\nWith some delay I ask for forgiveness\n\nSome technical issues..\n\nBelow 100k is soon⏳",
      "timestamp": "Oct 17, 2025 · 7:11 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979082901229641848#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979081139756134904#m",
      "content": "In the recent months clowns told us:\n\n- October to be a very bullish month\n- Altseason is very close, cup and handle\n- The bear market indicator did not flash\n- Mocked all of DrProfits bearish posts\n- BTC to follow Gold + BlackRock buying\n\nThank you for being such good clowns",
      "timestamp": "Oct 17, 2025 · 7:04 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979081139756134904#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979078614957097097#m",
      "content": "I called the macro top in 2021 at 68k\n\nI called the macro bottom in 2022 at 18k\n\nI called the macro top in 2025 at 125k\n\nI call for the macro bottom 60-70k ⏳",
      "timestamp": "Oct 17, 2025 · 6:54 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979078614957097097#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979076242587414936#m",
      "content": "I can’t take it anymore I’m laughing since one hour, please humble me oh market …",
      "timestamp": "Oct 17, 2025 · 6:45 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979076242587414936#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979075150453604394#m",
      "content": "‘Whenever September closes in Green\n\nOctober closes with two Digit in Green’\n\nNever forget these clowns, I laugh hard",
      "timestamp": "Oct 17, 2025 · 6:40 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979075150453604394#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1979074736425701408#m",
      "content": "We have been told altseason in April\nWe have been told altseason in May\nWe have been told altseason in June\nWe have been told altseason in July\nWe have been told altseason in August\nWe have been told altseason in Sept.\n\nFinally altseason arrived in October!",
      "timestamp": "Oct 17, 2025 · 6:39 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1979074736425701408#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978979687280923123#m",
      "content": "I’m impressed by two things, the amount of people that hated me for weeks and now agreeing with me in silence, and the amount of early buyers who think that every dip needs to be bought. If you lose money here you are absolutely retarded, short the dumb money, it’s all yours!",
      "timestamp": "Oct 17, 2025 · 12:21 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978979687280923123#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978978406449529201#m",
      "content": "Fear and greed index will hit extreme fear in the coming days, we will see more and more continued sell pressure and red numbers. Get ready for the most profitable days in your life friends!",
      "timestamp": "Oct 17, 2025 · 12:16 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978978406449529201#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978971758817361939#m",
      "content": "Weeks ago I kept sharing very important data, such as insider selling or supply in profit, or other important macro data. Guess who ignored it once again? Greedy Bulls!\n\nTHE BIG SHORT PARTY MUST GO ON",
      "timestamp": "Oct 16, 2025 · 11:50 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978971758817361939#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978967387966759060#m",
      "content": "Regional banks are crashing hard and the reason is obvious: The entire market’s liquidity has dried up. This is the direct result of years of QT. It’s far from over and will eventually hit a major bank, triggering a repeat of 2008. The bear market started!",
      "timestamp": "Oct 16, 2025 · 11:32 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978967387966759060#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978832319579340858#m",
      "content": "I said a correction to 90k is coming\n\nI was wrong BIG TIME and the market humbled me for not being bearish enough. I expect 60-70k instead and I feel ashamed for not having been bearish enough. Please accept my apology on this matter",
      "timestamp": "Oct 16, 2025 · 2:36 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978832319579340858#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978830032832233821#m",
      "content": "I was the first to call the bear market\n\nI was the first to call the REPO crisis\n\nI was the first all over X to sell the top\n\nI was right, right and once again RIGHT",
      "timestamp": "Oct 16, 2025 · 2:26 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978830032832233821#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978829370287366522#m",
      "content": "Everyone believes that the end of QT will mark the beginning of money printing, and that’s a big WRONG! Do you understand what happens if the economy is forced to run under tight liquidity? Do you realize that historically, the Fed only starts printing after a major crisis?",
      "timestamp": "Oct 16, 2025 · 2:24 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978829370287366522#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978828082380157141#m",
      "content": "Now everyone speaks about a possible REPO crisis? You guys are late, I highlighted exactly what we see today two weeks ago in the Sunday report, read for your own benefit:",
      "timestamp": "Oct 16, 2025 · 2:19 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978828082380157141#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978611890210111867#m",
      "content": "I’m really disappointed with Lamborghini!\n\nA month ago, when BTC was around 120k, I went to Lamborghini to place a special order. Today, I finally got their reply. This reply makes me sad..",
      "timestamp": "Oct 16, 2025 · 12:00 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978611890210111867#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978446551845343458#m",
      "content": "#Bitcoin: Bulls and Bears, both are right for next days, as the short-term probabilities are balanced, but come back after one month, and you will find the bear FULLY dominates. We are already in a bear market, and the next big move to the downside is just a matter of time!",
      "timestamp": "Oct 15, 2025 · 1:03 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978446551845343458#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978439099527708783#m",
      "content": "#Bitcoin: We are in the early phase of the bear market. This phase usually begins with many fake pumps and sharp downside moves, exactly what we saw last week. Remember, dead cat bounces are the biggest enemy for us shorts. Play them or ignore them, but don’t fight them",
      "timestamp": "Oct 15, 2025 · 12:33 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978439099527708783#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978437830155120965#m",
      "content": "Many asking what is next! \n\nThis chart I shared at 119k tells all\n\nThe big picture is EXTREME bearish!",
      "timestamp": "Oct 15, 2025 · 12:28 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978437830155120965#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978429722406068316#m",
      "content": "Did you know the BIGGEST LOSER of the Dot Com bubble was Michael Saylor? He lost over $6B as $MSTR crashed 99%. We are in a simulation, so the scenario repeats! This time, with the AI bubble, and Saylor will be the biggest loser again. My big short also includes MSTR!",
      "timestamp": "Oct 15, 2025 · 11:56 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978429722406068316#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978059384526696815#m",
      "content": "#Bitcoin: Most people don’t understand how difficult it is to get new data to analyze, Probably I’m the only account as well giving a clear path at this point. The problem I currently face is the tiny amount of fresh data available. I analyze the market daily, and there is almost not enough data from the date of the crash till this day. It’s very important to work with NEW data rather than OLD data! Old data was already used, thrown into the bin with the recent crash! This is why we need to stay cautious for the short term as YET no NEW data can confirm the next short term move, because we don’t have any important data to work on yet! This is the reason why yesterday’s data was bullish and today’s data was bearish! And yet, this affects only the short term planning and not the big picture!\n\nThank you for understanding",
      "timestamp": "Oct 14, 2025 · 11:24 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978059384526696815#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978048189212328262#m",
      "content": "The importance of being like water \n\nI expected a dead cat bounce yesterday\n\nBut after seeing today’s data I said SHORT\n\nThe market remains extremely bearish!\n\nOur big short continues to print !",
      "timestamp": "Oct 14, 2025 · 10:40 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978048189212328262#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978014528777412965#m",
      "content": "#Bitcoin has entered the early phase of the bear market, but short-term dead cat bounces may appear across BTC and altcoins, which is exactly why only a fool becomes max bearish right AFTER a heavy drop\n\nBears who entered after the big move deserve to be liquidated. Who agrees?",
      "timestamp": "Oct 14, 2025 · 8:26 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978014528777412965#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1978009765163799038#m",
      "content": "Price expectations for #BTC are as follow:\n\nIn the short term, the market still shows limited signs of a potential relief scenario, meaning a temporary bounce or dead cat move could occur before the main move which is to the downside, continues. There are three types of trades: short term, mid term, and long term.\nWhile the mid and long term remain clearly bearish, the short term shows the idea of a relief pump, in other words dead cat bounce, in other words a pump that happen before the next big downside move. This was the reason we took profits on our short positions yesterday and re-entered the market through BTC spot.\nAs of today, however, the data no longer supports that relief scenario. Therefore, I’ve reversed the short-term positioning, sold the BTC spot and re-entered the short side.  Nothing has changed in our broader plan. We are in the early phase of a bear market. While short-term dead cat bounces should be considered and traded when worth it, the big picture remains extremely bearish.\n\nShort Term (This Month): Neutral, yesterday slightly bullish rather than bearish, but with new data its back to neutral, we need more data to give the final short term decision. The short-term direction remains data dependent which is not fully available at this point due to the recent big move. This is why the chart shows the potential of a relief pump.\n\nMid Term (1–3 Months): Bearish. As in our original plan and main analysis since the region of 115-125k, Bitcoin top was reached and we are in the first days of the bear market. Potential dead cat bounces are possible but all in all the mid term price direction goes clearly to the downside\n\nLong Term (3–12 Months): Also as explained in many Tweets weeks ago, the long term scenario remains extremeley bearish. Nothing changes on this fact that the entire macro economy is set for a global earthquake, and its very close. Closer than most of people believe",
      "timestamp": "Oct 14, 2025 · 8:07 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1978009765163799038#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1977810387484459068#m",
      "content": "#Bitcoin: After considering today’s stock market opening, and the fact that markets completely ignored the China tariffs, we are doing exactly what we needed to do as outlined in the Sunday Report. We already took profits on half of our short positions and re-entered the market (Spot: BTC, ETH, SUI, XRP, HYPE, ONDO…) on the day of the crash realizing maximum profits and entering back the market at maximum lows with half of the position size. Now it’s time to take full profit on the remaining half of the #BTC short, along with the rest of the remaining altcoin shorts, fully closing all the remained half of short positions with gigantic profits. Congratulations to everyone, and thank you for your trust and discipline. Please read the Sunday Report for more details.\n\nAfter this recent market reset, only a fool would remain bearish. Moves of this magnitude, especially those involving heavy manipulation and open-interest destruction always end up in strong upside reversals following a liquidation cascade. The 90k target is no longer necessary. I wanted to see a massive liquidation event, and we got exactly that. Even a quarter of this wipeout would have been possible only if BTC had dropped to 90k, yet we witnessed a far larger event without the need to have BTC at 90k. Due to this massive manipulation, 99% of all altcoin long positions were wiped out. Again, this is exactly what I wanted to see, and it happened! \n\nBe like water, exactly as described in the Sunday Report. The main moves remains to the upside as mentioned in the Sunday report. Indeed, we played this move perfectly, been bullish when it’s time to be bullish, became bearish at the most perfect time, and back bullish when the event happened. Thank you for understanding\n\nJoin premium: whop.com/drprofit-trading/dr…",
      "timestamp": "Oct 13, 2025 · 6:55 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1977810387484459068#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1977476174545883200#m",
      "content": "The fact that most of altcoins are in a re-set mode is BULLISH. But we need to continue to watch the stock market behavior. Once there is a bullish confirmation we can expect way higher Altcoin results. Being bullish on altcoins was PUNISHED few days ago, be bullish after the re-set is the only way to go\n\nAs mentioned, all eyes on stock market for further confirmation and more upside",
      "timestamp": "Oct 12, 2025 · 8:47 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1977476174545883200#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1977470390902333876#m",
      "content": "#Bitcoin/ Stock market – What’s Next?\n\nThe Big Sunday Report: All You Need to Know\n\n🚩 TA / LCA / Psychological Breakdown:\n\nThere is no longer a reason to stay MAX bearish as we have been recently after the most recent liquidation event, this does not mean to become MAX bullish. Trading is more than black and white and now is the moment to analyse the next big move. The record breaking liquidation cascade is exactly what I wanted to see, and it finally happened. Congratulations if you survived the largest liquidation crash in crypto’s history. Confirmation to everyone who shorted the market with me, including the many altcoins that went straight to zero and the buy orders that got filled for us at extreme lows. The short profits on altcoins were insane, far more than most ever made trading them. Everyone who trusted my calls and warnings is now sitting as a winner.\nOver 1.6 million traders liquidated, an unprecedented figure that shows how crowded the long side was, again exaclty as I mentioned in the last weeks, something we never saw before. Practically everyone who was long got wiped as prices collapsed to zero in countless pairs. Since August, market makers have been selling BTC and altcoins heavily, quietly building short positions while retail kept buying and longing every small bounce. I called this range a distribution phase for a reason it was clear that a massive liquidation event had to come, and it did. Ladies and gentleman, this trade was Perfectly executed. Several altcoin buy orders that have been shared in DrProfit Premium Telegram (Join: whop.com/drprofit-trading/dr…) two weeks ago were triggered:\n\nSUI at $0.90\nXRP at $1.60\nONDO at $0.40\nETH at $3,200\nHYPE at $20\n\nThis is one of the most insane trades I ever took, shorts printed hard especially on altcoins, and the buy orders that triggered caused an event of max profits, something that cant be described in normal words.\n\nThis strategic wipeout can have two possible meanings:\n\nMarket makers have decided to end the bull market and realize their final profits on altcoins, longs, and spot holdings after weeks of distribution. Or this was the cleansing event before the next leg, a total reset before renewed accumulation, especially to send altcoins higher. So what will it be and what is the correct way of positioning? The answer is more complex as this requires a strong risk management, especially in our situation the gains are massive, we have the over-hand to decide and take risks, others can only dream about. This means, our altcoin entries are something that needs another 20-25% BTC drop to see our altcoins visiting our entry price, for this I consider my current altcoin bags extremley safe. \n\nThe Blood Moon event prediction played out too, historically, 21–28 days after a blood moon, a sharp market crash follows. This time it came after 33 days. The rule repeated. Today’s move didn’t just destroy retail bulls, it also hurt structured trading desks and even some market-making firms, that shows something major broke beneath the surface. We’ll see the full picture in the coming days or weeks. This is why I mentioned that the situation is more complex than up or down right now, we dont have the extreme anymore. The extreme was days ago, bulls have been extreme, they have been greedy and desperate. They got humbled, now the market is clean. Interestingly, the event came just days after FTX repayments, something I warned about repeatedly. Events following those repayments tend to be extremely bearish, either driven by fear, manipulation, or strategic liquidation of new inflows. And that’s exactly what this was: a total annihilation of leveraged longs, as almost EVERYONE in a long position, even with a leverage of 2-3x was liquidated. This is why you have seen DrProfit holding zero altcoins or ZERO altcoin longs before this crash happened.  The real target was clear, to liquidate as many players as possible, especially the overleveraged altcoin crowd. Altcoins saw liquidation rates close to 99%. They are fully cleaned. That’s why I consider our current altcoin entries extremely safe, even if BTC sees another drop. Our positions remain:\n\nSUI at $0.90\nXRP at $1.60\nONDO at $0.40\nETH at $3,200\nHYPE at $20\n\nThese remain long-term positions to hold.\n\nDon’t fall for the media’s narrative that tariffs caused this crash. The truth is simpler: greed and leverage destroyed this market. The same reckless euphoria that always ends the cycle. Even the stock market reflects similar pressure. On Monday, U.S. markets open as usual, but because of Columbus Day, all Federal systems except FedNow will be closed. That means financial institutions won’t be able to transfer funds between each other, a dangerous setup if stocks drop and margin calls start.\n\n🇺🇸 Stock Market (NYSE & Nasdaq): Open\n🏦 U.S. Bond Market: Closed\n🏛️ Federal Offices & Banks: Closed\n📦 USPS Mail Delivery: Closed\n\nOn the macro front, China has just banned purchases of NVIDIA GPUs, which is massive considering China accounts for ~40% of NVIDIA’s revenue. Many of those sales booked through Singapore and Taiwan were to Chinese clients all along. Now, both China and U.S. firms are cutting GPU demand, with American companies accelerating efforts to replace NVIDIA chips with in-house alternatives. As predicted, NVIDIA’s demand cliff is forming, and the company is scrambling to cover it up with inflated figures before the decline becomes obvious.\n\nMarket Context: \n\nThe historic altcoin liquidation event we witnessed has effectively delivered what the 90k BTC target was meant to trigger. This means the original downside projection must now be recalculated, as the market achieved the same cleansing effect without BTC needing to hit 90k. Outlook: For now, the strategy remains simple, hold cash + the BTC and altcoin spot positions and the BTC short hedge until Monday’s stock market open gives us new directional clarity, maybe the clarity needs more time, but from there, we will determine whether the next major leg favors renewed bullish accumulation or continuation of defensive positioning. In the meantime, if for example the price goes up, our altcoins and BTC spot position will print big while the short positions for altcoins and BTC will decrease in value, but will not touch the red. Based on the fact that the short positions have been closed half of position size during the crash, we already realized half of the profits, and these profits ended up into the BTC spot position allowing the highest form of risk management and capital protection. \n\nCurrent Portfolio Summary\n\nBTC Strategy:\n\nHalf of BTC short profits rotated into spot buys between 105–110k, as shared with you in the premium membership. The other half of the short remains open, serving as a HEDGE. This gives us complete control and protection in both directions. \n\nAltcoin Strategy:\n\nRSR and AVAX shorts HALF closed with profits between –40% and –50% during the crash. Perfect entries triggered for other altcoins mentioned above. My largest altcoin position is #ONDO with an average entry between $0,40 and $0,50 followed by #SUI with an average entry of $0,90. In the next days I will consider closing the other half RSR and AVAX shorts, or to keep them open. It depends on the stock market. \n\nOutlook:\n\nThe market achieved the same cleansing effect we expected at 90k BTC, without BTC even touching it. That changes the technical outlook. We now wait for the stock market open on Monday for confirmation whether the next leg will be bullish or if this was the final top, but as for now I lean towards a BULLISH move with a new ATH at $130,000! The most important thing is to see the white line to hold, if losing it I expect to hit the purple line next. Means, the white line has to hold at all cost, its the invalidation of the bullish thesis. No matter what I lean bullish as of now, but this doesnt change my risk management strategy. We have all the time to adjust, based on the stock market opening. Again, I see a great opportunity with every crash, when there is blood in the streets its to be bought. This is what we did at 105-110k when we bought BTC during the dip and added the altcoins. Now its time to watch the market how it behaves. This is a very short term decision and the final decision will be made in a couple of days wether to keep the bullish theory or to remain with the original plan to stay bearish. Based on our decision we will act on our trades and pull the final triggers, now the strategy is to have the triggers ready, but to pull we need to watch the stock market reaction. There is no need for full risk exposure as both, bull and bear sides have now the same probabilities after the recent crash. I hope you understand.\n\nNow let the dust settle, we prepare for the next major move. It’s still early to call the next direction with certainty, but one thing is already clear: the max-bearish scenario is off the table. The market has reset. Bulls and bears now stand on equal ground in crypto, the imbalance is gone. However, equities haven’t caught up yet. That’s why the stock market opening and the Japanese Yen’s movement remain the key signals to watch.\n\n Join DrProfit Premium: whop.com/drprofit-trading/dr…\n\nTrade with DrProfit on BloFin: Trade with DrProfit on BloFin: blofin.com/invite/DrProfitCr…\n\nTHIS IS NO FINANCIAL ADVICE AND EDUCATIONAL CONTENT ONLY",
      "timestamp": "Oct 12, 2025 · 8:24 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1977470390902333876#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1977454630062956679#m",
      "content": "Who hungry for Sunday Report ?",
      "timestamp": "Oct 12, 2025 · 7:21 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1977454630062956679#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976919979565183069#m",
      "content": "I said I would buy the garbage altcoins 70–90% below their current prices a month ago. People seriously asked if I was kidding! They called me crazy, indeed it’s crazy until it isn’t.\n\nSome of my buy orders shared in Premium that were triggered today:",
      "timestamp": "Oct 11, 2025 · 7:57 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976919979565183069#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976912569849012684#m",
      "content": "Since August, I’ve been warning about the extremely over-leveraged altcoin market and called for a massive liquidation event. Yet people ignored the warning and today, we’re writing history with the largest amount of liquidations ever reported. Indeed, I was right again",
      "timestamp": "Oct 11, 2025 · 7:27 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976912569849012684#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976890417137565878#m",
      "content": "Whats your feedback on DrProfit premium membership ?",
      "timestamp": "Oct 11, 2025 · 5:59 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976890417137565878#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976868549038883036#m",
      "content": "Only a retard of bull believes that tariffs caused the crash today. Market makers prepared for this move for a long time, all it needed was one bad news to start the liquidation event.  Hope you understand",
      "timestamp": "Oct 11, 2025 · 4:32 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976868549038883036#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976864482015191505#m",
      "content": "To understand what happened today:\n\nCovid crash: $1.2B in liquidations\nFTX crash: $1.6B in liquidations\nToday: $19.14B in liquidations\n\nCongratulation if you survived the largest liquidation crash in cryptos history! Alone this you should consider as big win!",
      "timestamp": "Oct 11, 2025 · 4:16 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976864482015191505#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976829964050940193#m",
      "content": "Market has not bottomed out yet, its important to wait for more clarity, and there wont be clarity till Monday opening. In my humble opinion the bear market just started, but lets wait for Monday and the next 1-2 days to have more clarity on this matter",
      "timestamp": "Oct 11, 2025 · 1:59 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976829964050940193#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976820073253028180#m",
      "content": "Largest position remains USDT and BTC short\n\nMove like water !\n\nNow it’s time to study possible market reactions on Monday at the stock market opening. In the meantime, we are riding some alts, BTC spot, and half of the BTC short position. The goal is to finally have a clear plan on what to do next, whether to be bearish or bullish, short-term or mid-term. A lot has changed today, and we need to analyse the market from a new perspective after today’s move\n\nIn terms of probability I was 99% bearish till this day, and after the mass liquidations my bearish stance drops to 70-75% for the crypto market. Some confidence to add some positions, but not much confidence in the market yet to enter big or with serious size.",
      "timestamp": "Oct 11, 2025 · 1:20 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976820073253028180#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976800473387544883#m",
      "content": "Considering my prediction fulfilled:\n\nWe have witnessed the largest liquidation event in the history of Crypto. This is exactly why I wanted to see #BTC at 90k, but that is no longer necessary, as the largest liquidation already occurred without BTC needing to reach 90k. What’s truly fascinating is that my altcoin shorts and buy orders printed far more profit than my BTC short, even though the BTC short was the largest position I’ve ever taken. Indeed, the largest profit ever made was today!\n\nAdded BTC spot aggressively in the 105–110k range, and now deploying short profits to accumulate even more Bitcoin. Totally realised half of the BTC short profit, other half is open with stops at entry. On top of this, buy orders shared back in September (In Premium) all perfectly TRIGGERED:\n\nXRP: Entry at $1.60 → Now +50%\nSUI: Entry at $0.90 → Now +240%\nONDO: Entry at $0.45 → Now +50%\nHYPE: Entry at $22 → Now +70%\n\nThis is a very short term strategy and we need to move like water in the coming hours or days. I always tend to buy when there is blood on the streets, if it dips more, the other half of BTC short will print, and even the -% in red will be removed from the MASSIVE profit we made today. This is one of the trading strategies I use at euphoria events, it allows me to control all aspects and all moves and benefit with max protection, capital risk management and strong profit! I hope this is understandable, its no longer up or down at this point, its now protect PROFIT MADE capital and prepare for the next strategic move.",
      "timestamp": "Oct 11, 2025 · 12:02 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976800473387544883#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976784054591594620#m",
      "content": "It was not an easy trade. The daily hate I received all over X was something I managed to ignore well. But it opened my eyes to these lying and dangerous individuals. What a shame of people we have in our industry! With today’s liquidation cascade, everyone and truly everyone who was long on altcoins is now liquidated. The same people that mocked me daily are down to zero today and most likely LOST all their money, and yet I feel extremely sorry for them despite they kept hating me daily\n\nIt’s a sad day for me, even though I made the largest amount of money I ever made during my trading career today.",
      "timestamp": "Oct 10, 2025 · 10:57 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976784054591594620#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976780524153680293#m",
      "content": "#Bitcoin: It’s time to remove the MAX BEARISH thesis. I made more money today than during the entire bull market in the last three years. What we saw today is beyond any imagination. We witnessed exactly what I wanted to see a full flush of altcoin liquidations across the over-leveraged markets. “Be like water” means recognizing the current opportunity, lean back and play it perfectly. In my last post, I already described my current strategy. Todays date is historic! \n\nConggrulation on those who followed me, i receive DMs of people that tell me they never made that much amount of money in their entire life. Indeed, the Big Short played out. I am realising gains here.",
      "timestamp": "Oct 10, 2025 · 10:42 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976780524153680293#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976777354849439803#m",
      "content": "#Bitcoin: We need to re-calculate our positions now, the 90k prediction was based on a liquidation cascade on altcoins, we saw this TODAY. So the question remains, will we see 90k? The answer is why? We saw HISTORIC altcoin liquidations and I personally expected the altcoin market to be hit hard with a BTC price of 90k. Seems this is no longer needed at all. We need to re-calculate our positions and the next moves and steps will be very important. For now as update:\n\n1) Realized 1/4 profit of the BTC short\n2) Realized half of RSR+AVAX short profit\n3) Buy orders that triggered for some altcoins\n4) Mainly remain in cash and BTC short\n5) A mix of existing positions + short now\n6) Patience for new strategic orders",
      "timestamp": "Oct 10, 2025 · 10:30 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976777354849439803#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976776336124658151#m",
      "content": "THE BIG SHORT - (PREMIUM PRINTS HARD)\n\n#AVAX AND #RSR DOWN HEAVY 70%\n\nREALIZED HALF OF POSITION SIZE PROFIT!",
      "timestamp": "Oct 10, 2025 · 10:26 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976776336124658151#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976773839519728123#m",
      "content": "Todays altcoin prices, some of them wont be even seen in the deepest bear market even if BTC goes for 50k for example. What we saw today is historic, and more than enough blood to enter into altcoins at these HEAVY 80% discounted prices!",
      "timestamp": "Oct 10, 2025 · 10:16 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976773839519728123#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976773112512626943#m",
      "content": "#SUI:\n\nBuy orders shared in premium two weeks ago\n\n+225% SINCE BUY ORDERS HIT 🔥",
      "timestamp": "Oct 10, 2025 · 10:13 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976773112512626943#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976772789165342777#m",
      "content": "#ONDO:  \n\nBuy orders shared in premium two weeks ago\n\n+54% SINCE BUY ORDERS HIT 🔥",
      "timestamp": "Oct 10, 2025 · 10:12 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976772789165342777#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976772508402827628#m",
      "content": "#XRP:  \n\nBuy orders shared in premium two weeks ago\n\n +50% SINCE BUY ORDERS HIT 🔥",
      "timestamp": "Oct 10, 2025 · 10:11 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976772508402827628#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976772153459851637#m",
      "content": "#ETH:\n\nBuy orders shared in premium two weeks ago\n\n+14% SINCE BUY ORDERS HIT 🔥",
      "timestamp": "Oct 10, 2025 · 10:09 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976772153459851637#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976771849100181606#m",
      "content": "#HYPE:\n\nBuy orders shared in premium (September)\n\n+73% SINCE BUY ORDERS HIT 🔥",
      "timestamp": "Oct 10, 2025 · 10:08 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976771849100181606#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976763474442436834#m",
      "content": "Max EUPHORIA.",
      "timestamp": "Oct 10, 2025 · 9:35 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976763474442436834#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976762271645770002#m",
      "content": "Ladies and Gentleman\n\nMy promise becomes true",
      "timestamp": "Oct 10, 2025 · 9:30 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976762271645770002#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976760092784574690#m",
      "content": "Everyone hated me for calling this",
      "timestamp": "Oct 10, 2025 · 9:21 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976760092784574690#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976759021613793408#m",
      "content": "Thank you for playing, party just started\n\nShorted between 115-125k ✅\nSold all Crypto at ATH levels ✅\nSaid there will be no alt season ✅\nCalled the bear market to start ⏳",
      "timestamp": "Oct 10, 2025 · 9:17 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976759021613793408#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976754861082394624#m",
      "content": "Predicted the 2021 top at 68k\n\nPredicted the 18k bottom in 2022\n\nPredicted the 115-125k top in 2025⏳",
      "timestamp": "Oct 10, 2025 · 9:00 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976754861082394624#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976749051019190305#m",
      "content": "Billions of Dollars of wasted liquidity is gone forever today, mainly grabbed from the pockets of retails. Its so sad to see this happening and all of this could have been avoided. Its still a great price to realise profits from this bull as the next months will be even worse",
      "timestamp": "Oct 10, 2025 · 8:37 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976749051019190305#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976731372346659060#m",
      "content": "Big silence from ALL of X accounts right now\n\nWhat is their excuse again for the Q4 altseason?\n\nHow dare have you been to mock DrProfit ?\n\nThank you for the hate and liquidity.",
      "timestamp": "Oct 10, 2025 · 7:27 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976731372346659060#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976730513428635856#m",
      "content": "One very long minute of silence for bulls\n\nI feel upset and sorry for your BIG loss\n\nOnly high IQs could have expected this",
      "timestamp": "Oct 10, 2025 · 7:24 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976730513428635856#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976696692033384618#m",
      "content": "In the coming days you will see more and more people calling that the bottom is in which will put them into the next legendary trap before the next and repeated low. You will also see many accounts on X trying to take credits, as if they predicted the dump. Many lies, misinformation, panic and confusion starts hitting the market. Alt coin believers will be left behind and lose it all, a fully over leveraged market and the party started for us bears.",
      "timestamp": "Oct 10, 2025 · 5:09 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976696692033384618#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976692869097570525#m",
      "content": "Remember that Bull market is over \n\nWe are in a strong bear market \n\nQ4 bull market is a scam",
      "timestamp": "Oct 10, 2025 · 4:54 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976692869097570525#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1976669868263907807#m",
      "content": "The people of X need DrProfit more than ever , poor moon boys throwing all existing garbage in their brains! BNB memes fully collapsed today! BILLIONS of retail dollars lost forever! Coins I always warned about such as ASTER, LIQUIDATED billions of billions of dollars! My warnings have been exceptional and I always said to sell & short between 115-125k ! Now my average short is at 119,900 region holding this position since August and It’s a matter of time to see the position in max profit! This is the failure many FAILED to understand. BUILD the position, was the strategy from day one!\n\nGive this post 20,000 likes and DrProfit will be back on X for you! Otherwise you can enjoy the beauty of the Moonboys who tell you altseason every day! THE DECISION IS YOURS! #DrProfitWasRight",
      "timestamp": "Oct 10, 2025 · 3:23 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1976669868263907807#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1974899444379427187#m",
      "content": "The Sunday report was my last post in this month\n\nSee you in November, stay safe friends!\n\nShort and strong - Bear coming.",
      "timestamp": "Oct 5, 2025 · 6:08 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1974899444379427187#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1974897481440719007#m",
      "content": "#Bitcoin/ Stock market – What’s Next?\n\nThe Big Sunday Report: All You Need to Know\n\n🚩 TA / LCA / Psychological Breakdown:\n\nThis is the last post I am going to publish this month. I will be back in November, in the meantime I will drink tea, tea and even more tea. The market is entering a highly unstable zone. Yet people cant see or understand due to the euphoria in the market, and yet my Sell Zone of 115-125k region remains a large distribution area in which large players are selling into the crowd that is buying happily not understanding that the sell pressure is not visible yet as retail buyers flow from all directions. While retail sentiment across X remains euphoric and todays fake pump that ended with a downside move after hitting the 125k will provide one more headline in the news \"BTC NEW ATH\" attracting more retails to jump in. While we see the same pattern in the stock market with record retail inflows since August, financial market indicators are flashing early warnings of a liquidity crunch brewing beneath the surface.\n\n1. The Repo Crisis That No One Wants to See\nEvery major market correction begins with a liquidity problem hidden in plain sight. Today, that red flag is the Reverse Repo (RRP) market. RRP usage has collapsed from a $2.2 trillion peak (mid-2022) to just $8–10 billion today, a 99% drawdown. This “cash on the sidelines” narrative is officially dead. The buffer that once stabilized interbank liquidity has vanished. Historical parallels (2018, 2019, 2023) show that when RRP dries up completely, markets soon face severe dislocations, repo stress, funding squeezes, or even emergency Fed interventions. The Standing Repo Facility (SRF) is now the only liquidity backstop. If reserves fall near $3 trillion, banks will tap it aggressively, the modern version of “printing in panic.” but it will be too late. Translation: We are one shock away from testing the Fed’s tolerance for financial pain. I keep repeating my words, dont fight the Dollar (DXY) and the golden rise is ahead for the DXY!\n\n2. The “$7 Trillion in MMFs” Myth\nA popular claim on X and elsewhere is that “$7 trillion in Money Market Funds (MMFs)” will soon flood equities or crypto. That is 1000% false as MMF capital must flow into T-Bills, repos, or the Fed’s RRP facility, not assets. When MMF cash moves, it DRAINS liquidity from the real market, not adds to it. In short, the liquidity pyramid is tightening from the top down, not expanding.\n\n3. U.S. Banking Fragility\nU.S. banks hold roughly $395 billion in unrealized losses (Q2 2025), quietly pressuring balance sheets. History shows: The Fed doesn’t start printing in calm seas, it waits for something to happen. A controlled crash may be exactly what they need before launching QE 5.0\n\n4. Crypto Market:\nETF inflows: BlackRock and other issuers added >$1 billion in BTC and $200 million in ETH last week and Large wallets have slowed but not fully stopped in selling since late September; short-term holders already capitulated in August–September. Bollinger Bands, the tightest since major breakouts, suggest a strong move is near to one or the other direction. Remember: Bitcoin has never decoupled from stock-market liquidity. If equities face a repo-driven shock, BTC will initially dip with risk assets before becoming the first beneficiary of the post-crash liquidity wave. Retail traders are once again chanting the “liquidity flood” myth, ignoring macro fragility. This is the same delusion seen before the 2022 crash, euphoria at the edge of systemic stress. We can see clear FOMO metrics are rising. Leveraged longs are at cycle highs and Yet under the surface, liquidity is collapsing. Since August I have sold my entire Crypto Assets and started to build short positions in the region of 115-125k with current average entry of 119,9k region. My plan is to hold the shorts and consider the current zone as banana zone which is indeed a sideway zone between 115-125k as told in August. Next to the tripple top we also see a massive bearish divergence forming on the weekly chart, the same divergence was the reason for the end of 2021 bull market, we see the same indicator giving us a warning again! A warning that should not be ignored in my opinion! If for any reason BTC breaks out above my 125k level, I need to prepare to hold for several days/ weeks in red before it turns back in profit. My strategy is for the long term and I held my coins for 3 years before selling them all realising a massive profit of 600% in BTC alone or selling ETH at the top of $4,800. More than happy to be positioned well for the upcoming events. In the meantime, drinking tea and relax.\n\n5. MSTR & the Yield-Panic Signal\nMicroStrategy raised its preferred-share yields from 10% → 10.25% (up from 9% only weeks ago), a sign of funding strain. Behind the scenes, Saylor’s “Bitcoin flywheel” ($MSTR → $STRC/$STRD/$STRF preferreds) is losing traction. Constant share dilution has eroded MSTR’s mNAV premium, now underperforming BTC by ~25% in 6 months.  New preferred issuances try to mask liquidity gaps with double-digit dividends, an unsustainable model unless BTC keeps rising faster than issuance. Without fresh inflows, the structure risks becoming a closed-loop Ponzi flywheel, similar in dynamic to Terra/Luna and the reason for the next bear market.\n\n6. Inisider Selling: Since August we see the largest amount of Insider sales in the last 2-3 years, till this day insiders continue to dump their own shares into the market in a massive speed. At the same time we have the largest retail investor inflow as well! This mix is highly toxic and usually occurs at cycle tops!\n\nQuestion for the Bulls: If you believe 140k will hit before the bear market starts that’s only 14% higher from here. Are you really willing to risk everything for a possible 14% move? What if the market never reaches 140k? You’ll be stuck holding, waiting for a top that never comes, and end up selling much lower, or not selling at all. This is how every cycle ends for most people: “I didn’t take profits.” See you in a month! Premium will remain active and updated as usual.\n\nOverall market remains very bearish at a macro level, and even bulls in Crypto or Stocks agree that the bear market will start in the end or after Q4. In the meantime, we see the final rat race I am not taking part in. Instead, I start to short in anticipation on whats coming!\n\nJoin premium here: whop.com/drprofit-trading/dr…\n\nTrade with DrProfit on BloFin: blofin.com/invite/DrProfitCr…\n\nTHIS IS NO FINANCIAL ADVICE AND EDUCATIONAL CONTENT ONLY",
      "timestamp": "Oct 5, 2025 · 6:00 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1974897481440719007#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1974521212446621739#m",
      "content": "Stock Market Insiders continue to sell:\n\nOut of 200 Insider trades registered since the end of September beginning of October, 189 are SELL, 7 are buys! This massive amount of insider profit taking started since August and continues till this day",
      "timestamp": "Oct 4, 2025 · 5:05 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1974521212446621739#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1974392858837999781#m",
      "content": "#Bitcoin: I ask for forgiveness for being a sinful bear, for adding more shorts over the past two days and raising my average entry to $119,900\n\nSince August I tell 115-125k is SHORT area",
      "timestamp": "Oct 4, 2025 · 8:35 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1974392858837999781#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1974138041087467809#m",
      "content": "Bearish Euphoria !\n\nThis red will be green, matter of time",
      "timestamp": "Oct 3, 2025 · 3:42 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1974138041087467809#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1974130809675088134#m",
      "content": "#Bitcoin: Adding my final amount into the accumulation of heavy shorts at this level. This completes my position I started to build 40 days ago, while preserving a healthy margin ratio and keeping liquidation levels comfortably away. Adding more beyond this point would unnecessarily tighten my liquidation buffer, which I will strictly avoid\n\nThis is the last short entry I am taking\nPosition is: 100% USDT, Short\n\nThe accumulation of my position is completed",
      "timestamp": "Oct 3, 2025 · 3:13 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1974130809675088134#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1973790925613633555#m",
      "content": "To give you a visual explanation of what’s in my mind in an extreme bearish case, don’t be a low IQ and take this chart as a perfect template, because not everything can be seen in advance. But it illustrates how I believe things unfold into year end and early 2026. I expect bearish months ahead, with bounces and short-term opportunities in between. The overall market structure remains EXTREME bearish. \n\nFor those asking why we placed recent altcoin buy orders, its to capture the bounce that is likely to happen in 90-94k region. I see it aligning with the broader market in the coming weeks. Once that bounce exhausts, I expect more continuation to the downside.\n\nRemember: markets need traps to fuel the next leg down. We can either use the traps in our favor, ride the bounce, take profits, and position for the next wave lower or stay out of the market till we see a capitulation.",
      "timestamp": "Oct 2, 2025 · 4:43 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1973790925613633555#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1973756659286901152#m",
      "content": "Everyone, 99.9% is bullish. One view to the comments on DrProfit bearish posts tells you all you need to know about the market sentiment.  Not even one person is bearish. The crowd is always wrong, my shorts will be the big winners in the coming weeks and months",
      "timestamp": "Oct 2, 2025 · 2:27 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1973756659286901152#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1973747476281933849#m",
      "content": "#Bitcoin: First large short order triggered at $119,500. More large orders remain up till 121k and smaller - mid sized short orders till 125k region. This is the exact region I speak about since two months. 115-125k is my massive short entry region to accumulate more shorts",
      "timestamp": "Oct 2, 2025 · 1:50 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1973747476281933849#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1973536898275745806#m",
      "content": "This position is open for 40 days already \n\nSince August shorting between (115-125)\n\nPlacing more short orders from 119-125k\n\nLargest sized orders are between 119-121k",
      "timestamp": "Oct 1, 2025 · 11:53 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1973536898275745806#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1973350500604191026#m",
      "content": "#Bitcoin is back in the short area and all know what this means: I will continue to add more shorts in this region. Already accumulated a lot of shorts between 115-117k, I consider it as enough. Now I place orders between 119-125k if market is generous enough to make this gift",
      "timestamp": "Oct 1, 2025 · 11:33 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1973350500604191026#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1973123977175507436#m",
      "content": "Thoughts on the government shutdown: \n\nThe danger for markets is not only the shutdown, it’s mainly the missing data. If we see a government shutdown which is very likely now, the release of NFP and CPI will be delayed, leaving the Fed without the two most critical indicators just weeks before the October 28–29 FOMC. That forces monetary policy into guesswork at the exact moment the market needs clarity. This causes more confusion and uncertainty \n\nOn top of this September 30’s quarterly options expire. Once those massive “collar” hedges roll off, equities lose a very important stabilizer that has protected the market from downside shocks for months. When the options cushion vanishes, volatility has room to explode, and now guess to which side\n\nThe combination of both is very dangerous: FED operating blind, structural hedges disappearing, and liquidity will become less. This combination leads into MASSIVE MARKET UNCERTAINTY. Credit spreads, funding markets, and equity vol could all reprice violently if shutdown headlines collide with the thin market structure.",
      "timestamp": "Sep 30, 2025 · 8:33 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1973123977175507436#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1973116372294181314#m",
      "content": "The prediction of $100,000 did not hit!\n\nIn mid-August I called for Bitcoin to drop below 100k in September. I marked the 115,500–125k region as my sell and short zone. That’s exactly where we exited spot and entered shorts. Bitcoin has since traded down 9% and is still below that entry at ~114k. The target remains 90–94k. Hundreds of accounts are now posting that call, twisting it with claims of “deleted tweets” Or mocking because the dump didn’t happen before September’s close. (LIE! Tweet not Deleted: localhost:8080/DrProfitCrypto/status/… )\n\nFor clarity: this is the first time since 2023 they’ve found a call to criticize. The same accounts mocked me at 18k, mocked me during the 50–78k range in 2024 that I predicted and navigated with precision, and mocked the “box strategy” that carried us to 100k. Every time, the result was the same: the call played out. (Receipts: localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…)\n\nIn early 2025, I turned bearish at 88k and gave two paths: bounce at 74k or deeper recession-driven move to 60k. Bitcoin hit 74k, exactly as projected, and we re-entered at 77k after taking profit on the shorts and i gave the target of 100k, later on the box of 105k and targets of 125k. The framework has been consistent: identify the zones, execute, re-enter lower. (Receipts: localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…)\n\nNow the same applies again. The sell zone was mentioned. Shorts and SELL SPOT were taken. Price reacted as expected. The market is still trading under the short and sell entry. The next zone is 90–94k.\n\nPredictions of this scale take time. I was early, but not wrong, and the 90–94k target will be hit. Swing trading is not about one candle, one day, or one week. It’s about holding through the noise until the level is reached or invalidated. I entered in August, I’ve held for a month already, and I’ll hold for more months if needed. The direction is set. The downside move is coming. While others scream for “altseason” and “new highs,” I remain positioned for the crash that is next. To those pushing lies: if they had executed the trades with DrPROFIT, they would be in profit. Instead, their critics are on minor timing details while ignoring results.\n\nMost important to remember: In July I was among the first to call for an altseason. Altcoins did rally strongly, until mid-August, when I announced complete profit-taking, moving 100% to USDT and shorts. I warned it was a fake altseason. The outcome: less than 14 days of upside, followed by record liquidations, the largest in a year. That warning was exact, and the charts confirm it.\n\nFor ETH, the calls were equally clear: long from 1,800 and 2,200 targets to 3,800 with Extension targets 4,800–7,000 were noted, but at 4,800 I publicly announced exit. The top was sold, but detractors selectively ignore that exit and spread the false claim that I “called for 7,000.” (Receipts: localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…, localhost:8080/DrProfitCrypto/status/…) \n\nThe target of 90-94k is not invalid, just because of a delay in September.!",
      "timestamp": "Sep 30, 2025 · 8:02 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1973116372294181314#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1973104336352731467#m",
      "content": "Prediction of 100k in September didn’t hit\n\nAll of big X accounts going insane today\n\nHundreds, all speaking about DrProfit\n\nAnd yet DrPROFIT shorts are in profit..",
      "timestamp": "Sep 30, 2025 · 7:15 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1973104336352731467#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1972964026956009868#m",
      "content": "#Bitcoin: Bear market started in August?\n\nFirst: Since turning bearish in August, I remain fully confident that the 90–94K target will be reached. I expected it to happen this month, but no matter what, the price was on average 77% of days below DrPROFIT short and take profit on everything (SPOT BAG) entry since one month ago between 115,500 - 117,900 which proves DrPROFITs timing in positioning as correct, even now despite the bullish cheering all over the markets and people asking if we are liquidated yet, despite our position remain in profit and not even worth to further comment as everything between 115-125k is the range to short as mentioned in August!\n\nSecond: There is a STRONG probability that the market will not only hit 90–94K but also break below it, confirming that the bull market has ended. The test of 90–94K will serve as the ultimate confirmation of this thesis\n\nImportant: The probability of a bear market is extremely high, but confirmation still depends on the reaction in the 90–94K region. Only once that level is tested we can have certainty whether the bear has officially begun, or if 90–94K marks the bottom. I turned bearish early and in Time, back in August, between 115,500–119,000,  and most fail to grasp what that means. Moves projected on the weekly chart unfold over weeks, sometimes months. My analysis, issued in mid-August, remains fully intact. This does not imply that 90–94K must be reached within a week, nor does a bounce to 116–117K suddenly “invalidate” the thesis or liquidate DrPROFIT. Since August, I’ve been crystal clear: if the market is generous enough to hand us higher levels, like the mid-September fake pump to 117,800, then it is nothing but a gift from market makers, an opportunity to scale into shorts at even better entries.\n\nJoin DrProfitPremium: whop.com/drprofit-trading/dr…\n\nTrade with DrProfit on BloFin: blofin.com/invite/DrProfitCr…\n\nTHIS IS NO FINANCIAL ADVICE AND EDUCATIONAL CONTENT ONLY",
      "timestamp": "Sep 30, 2025 · 9:57 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1972964026956009868#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1972694608913076355#m",
      "content": "The mother of all top signals Jim Cramer is now bullish on BTC and calls to buy crypto. On top of that he is publishing a book by tomorrow on how to make money. These top signals should not be ignored as BTC is moving in top area territory. Too much bullish noise in the market!",
      "timestamp": "Sep 29, 2025 · 4:07 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1972694608913076355#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1972411184818381247#m",
      "content": "The money which is currently in the markets is absolutely retarded. We see a NFT hype currently on HYPE, a cat picture was recently sold for $50,000. The rise of NFT transactions and retarded money always happens at top regions",
      "timestamp": "Sep 28, 2025 · 9:20 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1972411184818381247#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1972325693255004605#m",
      "content": "#Bitcoin – What’s Next?\n\nThe Big Sunday Report: Everything You Need to Know\n\n🚩 TA / LCA / Psychological Breakdown: Bitcoin is perfectly following our plan and is right on track for the target of the 90–94k region. We are down 10% since our sell and short entry already and are ready to move towards the next downside target, which is located at the $106,000 region. This is the next target for the very short term and most likely to be seen in the coming days. A small bounce can be expected in the 106k area to fuel more liquidity into the downside. These days retails act bullish if you give them a 3–5% fake pump, and all you see in the markets are bullish posts, charts of potential reversal patterns, and altseason calls. Remove the garbage out of my face and focus on the main, which is 90–94k.\n\nThe market is now fully desperate and always needs new fuel in order to stay alive. Some of this desperate fuel comes directly from the Trump Family, with Trump calling for higher stocks, and his son Eric calling for buying the dip and a strong Q4 this year and a super bullish Q4 for crypto. You will see more of these supposed-to-be bullish news just to distract you and make you feel comfortable. Once you are distracted and feel comfortable with the bullish positioning, the next strike will come.\n\nThe entire economy looks extremely problematic. More confusion and uncertainty are guaranteed in the coming days and weeks: Japan’s 10-Year Bond Yield has reached the highest level since the Global Financial Crisis, the repo-to-reserves ratio is near 99%, which by default signals funding stress, margin strain, and forced selling. The only possible bullish angle would be if central banks flood the system with liquidity, but under current market conditions, I strongly doubt this will happen. On top of this, you can add the 30-40 indicators, informations and charts I have shared with you since August, and most importantly, that ALL of the key charts are at heavy resistance levels, some of them forming for more than 100 years, for example the Dow Jones. We can continue with the record amount of insider selling since the last 25-35 days, the record amount of retail investor inflows in the markets and the profit taking from bigger players and hedge funds.. I can continue to write a book about what I see, but even if I describe it, share it with you, few will believe because its the emotion that gets hurt, the vision of a never ending bull market. Prepare.\n\nSeptember Prediction: In August, I made it clear: Bitcoin would trade below $100,000 in September. We still have days left in September, but even if the exact date runs over, the call remains intact. Bitcoin already dropped 10% since my short and sell call, and ETH is down 20%. That is undeniable fact. Some will try to twist this as “wrong.” In reality, they expose their own ignorance. The market already moved exactly in my direction, and it only needs another 9% for BTC to break below $100K. Timing can never be perfect to the day, but direction and magnitude can. And I’ve nailed both. So when the same “GURUS” on X who screamed about an altseason 1-2 weeks ago, will appear in the coming days with screenshots of DrPROFIT posts saying \"BTC will be lower than 100K in September\", understand this: BULLS ARE FULLY DESPERATE. They ignore the fact that BTC is already down 10% and ETH collapsed 20% since my call.\n\nTrade with DrProfit on BloFin: blofin.com/invite/DrProfitCr…\n\n✅ Join DrProfit Premium:\n\nMonthly Subscriptions will not be available anymore by next week! If you’re already in or you join NOW, you’ll stay locked in as a monthly member, But from next week, NEW members won’t be able to access monthly anymore. This is your final chance to secure a monthly spot before it disappears. Once it’s gone, you will be able to purchase the six months, yearly or lifetime option only! Join here: whop.com/discover/drprofit-t…\n\nTHIS IS NO FINANCIAL ADVICE AND EDUCATIONAL CONTENT ONLY",
      "timestamp": "Sep 28, 2025 · 3:41 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1972325693255004605#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1972299210008740181#m",
      "content": "One thing DrPROFIT CANT understand\n\nBulls and bears saw the Tweets one month ago\n\nAll sirs saw DrPROFIT turned BEARISH in August\n\nWHY some act as if DrPROFIT did not warn them?\n\nNo, SOME even deny being thankful to DrPROFIT\n\nINDEED, DrPROFIT is your friend and WARNER",
      "timestamp": "Sep 28, 2025 · 1:55 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1972299210008740181#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1972294801979781603#m",
      "content": "#ETH: Sold the exact top at $4,800 in August\n\nBegged ALL to listen, but ALL called for altseason\n\nOne month later its down -20% since then\n\nNow I call for another -20% dump COMING!",
      "timestamp": "Sep 28, 2025 · 1:38 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1972294801979781603#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971912153117626508#m",
      "content": "Retail believes there’s no bear market without an altseason. But what if I told you there will be no altseason in this cycle? What if I told you I see a very high probability that the bear market has already begun? Patience, the bear will rule until year’s end",
      "timestamp": "Sep 27, 2025 · 12:17 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971912153117626508#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971908492828229929#m",
      "content": "Till end of year the entire Crypto market will have lost 30% of its entire value. A clear WARNING to those still chanting for a bullish Q4. The market is fully over-leveraged and is set for a strong and long downside move",
      "timestamp": "Sep 27, 2025 · 12:03 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971908492828229929#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971717856481194224#m",
      "content": "🚨 Stock Market insiders continue to Sell:\n\nOut of 200 insider trades this week, 199 were sells and only 1 a buy. Since mid-August insiders are unloading at record speed while retail buying at record speed",
      "timestamp": "Sep 26, 2025 · 11:25 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971717856481194224#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971525503292158299#m",
      "content": "#Bitcoin: Its down 9% from our short and sell all entry. I expect the downside move to continue strong and fear will increase. Next short term target is 106k region! The downside move will continue as promised",
      "timestamp": "Sep 26, 2025 · 10:41 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971525503292158299#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971517653765505056#m",
      "content": "You trade until you realise you are exploiting retails\n\nRetails are beeing exploited, they dont realise it\n\nThe liquidity is for all, take it or its taken from you",
      "timestamp": "Sep 26, 2025 · 10:10 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971517653765505056#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971516589154652471#m",
      "content": "The exploitation of retail has never been easier or more legal. They choose to hand me liquidity, then accuse the messenger when I warn them. I don’t argue with the crowd, I take their donations and continue my shorts. As long there remains one bull I lovely take his donation",
      "timestamp": "Sep 26, 2025 · 10:05 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971516589154652471#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971515684787225050#m",
      "content": "#Bitcoin: Fear is just beginning to spread. My shorts across the market are printing nonstop while bulls are bleeding exaclty as promised to you! prepared a month ago for this! Bulls thought they were in control, but I trade the market… the market now trades them!",
      "timestamp": "Sep 26, 2025 · 10:02 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971515684787225050#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971514706059039164#m",
      "content": "One month ago, I sold everything, since then:\n\n$ETH is down 20%\n$BTC is down 9%\n$XRP is down 14%\n$SOL is down 14%\nOther alts down between 25-40%\n\nNever marry your bags and be able to take profits!",
      "timestamp": "Sep 26, 2025 · 9:58 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971514706059039164#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971494808226234533#m",
      "content": "Bitcoin turned from greed into fear territory within one week! This confirms my thesis that markets are currently bearish rather than bullish. Expecting increased fear in the markets in the coming weeks!",
      "timestamp": "Sep 26, 2025 · 8:39 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971494808226234533#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971329685859729609#m",
      "content": "Full clarity for those who are asking:\n\nI expect 90-94k to be hit next\n\nWhat comes afterwards is early to tell\n\nWe either saw the top or will bounce at 90-94k\n\nWill give the update in time, for now its early to tell\n\nI see a 70% probability that the top is in so far",
      "timestamp": "Sep 25, 2025 · 9:43 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971329685859729609#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971328814862229880#m",
      "content": "While most people are thinking about Altseason, I’m preparing for the next cycle protecting capital and getting ready to deploy at lows. My plan is long-term, while 95% of others only chase the fast-money aspect. There’s no such thing as fast money and most of fast money fails",
      "timestamp": "Sep 25, 2025 · 9:39 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971328814862229880#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971312959927542178#m",
      "content": "Each altcoin just bled 20% on average today and if Bitcoin extends the dump, we’ll enter another pathetic “altseason” where bags only sink to fresh lows..\n\nPanic season instead of Altseason!",
      "timestamp": "Sep 25, 2025 · 8:36 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971312959927542178#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971242406248169802#m",
      "content": "Be like water! Whatever you believed yesterday, be ready to adapt today. When new information outweighs the old, you must factor it into the bigger picture, even if it changes the full view\n\nWinning is the only option, and this is currently achievable with shorts only",
      "timestamp": "Sep 25, 2025 · 3:56 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971242406248169802#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971192492445118867#m",
      "content": "Mastered the bull run on the way up\n\nNow mastering it in the downside\n\nUp or down, PROFIT is the only option!",
      "timestamp": "Sep 25, 2025 · 12:38 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971192492445118867#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971184385572691997#m",
      "content": "Congratulation for selling the $ETH top!\n\nWe sold the exact top at $4,800 \n\nAgain and again, DrProfit was right",
      "timestamp": "Sep 25, 2025 · 12:05 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971184385572691997#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971182614758449442#m",
      "content": "NEVER DOUBT DR PROFIT !",
      "timestamp": "Sep 25, 2025 · 11:58 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971182614758449442#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971182554511495216#m",
      "content": "Many accounts on X act like they “saw this coming” and celebrate the dump as if they were short. Days ago, the same accounts been screaming Altseason. I was the only healthy person, warning about the trap and got nothing but hate for it. Here you go!\n\nEnjoy your altseason!",
      "timestamp": "Sep 25, 2025 · 11:58 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971182554511495216#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1971181539540234406#m",
      "content": "Predicted the current trap on alts\n\nSo many over leveraged retails\n\nThey only wait for their liquidation\n\nI tried to be your warner only..\n\nIndeed I’m just a messenger..",
      "timestamp": "Sep 25, 2025 · 11:54 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1971181539540234406#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1722292676018471027#m",
      "content": "Protect your capital before you decide to invest in low cap altcoins, it’s a must read that protect you from scams that are happening daily on CT 🚨\n\nThat’s how they operate:\n\n1. Several influencers create a chat group in which they decide to shill coin x\n\n2. They buy many of these coins one month before start publishing coin name on CT. They buy the coins on several wallets to hide their true intention \n\n3. Influencer 1 starts shilling the coin, leading to a surge in the coin's value and benefiting all involved influencers.\n\n4. Few weeks later influencer 2 starts quoting influencer 1 Tweet and mentions something like ‘That’s a great pick imo’. Few days later he shares the same coin and pumps their bags much more\n\n5. Now influencer 3 starts retweeting the posts of influencer 1 and 2, and also tells you how many x this coin is going to print you. Reality, it’s only printing for these influencers\n\n6. influencer 1,2,3 and 4 sharing the same coin at same time and pumping it again. This mostly happens in times of euphoria once BTC starts pumping more than 10%. This causes a lot of FOMO in market and gives strongest pump\n\n7. Now this coin was pumped x10 already and the same influencers tell you how they predicted it and that you should listen when they shill next project. You ever wondered why you was never able to enter in time, despite following these influencers ? \n\n8. Now influencer 5,6 and 7 that never shared their views on the coin come in for the final pump. These accounts are mostly the largest accounts in terms of followers and interactions. You can expect the outcome, massive pump \n\n9. Now these 4-6 influencers use the next BTC dump to sell 20-25% of their bags and dumping on their followers, so the project doesn’t look rugged but ‚Dumping because of BTC bro‘\n\n10. They keep repeating this strategy until these influencers pumped their bags up x200 and more. Than they share screenshots and tell you that you better listen to them next time, because ‚Look Bro i told you, it made x200‘\n\n11. Cycle repeat, and you will always observe that these few influencers that work together, always shilling the same coins in same time frame\n\nProtect your capital from these scammers, Iam more than 3 years already on CT and witnessed, saw and heard a lot. I have the experience to tell you the truth, that’s why I decided to stay sidelined on CT and not making any friends here. Trust me, no one is here to help you, no one wastes his time if there is no profit for himself. I write Sunday report, and sharing my trade ideas to create passive income due to my premium channel, next to my trading income. I don’t even make a secret out of it. Everyone can decide to join freely, and 95% of members are more than happy with the service and there is nothing wrong with it to own a paid group, it’s wrong to scam people by promising them fake x that never will happen.\n\nProtect your capital and stay safe",
      "timestamp": "Nov 8, 2023 · 4:39 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1722292676018471027#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1970595601021813019#m",
      "content": "The prophecy is now complete\n\nFrom 16k to 120k, the target is hit\n\nMy bull journey is over, it was a good time",
      "timestamp": "Sep 23, 2025 · 9:06 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1970595601021813019#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1970240142142251048#m",
      "content": "Today’s dump was a liquidity grab, caused by Binance and the market makers. This wasn’t heavy spot selling from any whale or serious player, it was pure manipulation. The so called cartel engineered the move, and what’s even worse is the ocean of liquidity still waiting below.",
      "timestamp": "Sep 22, 2025 · 9:33 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1970240142142251048#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1970072896447160429#m",
      "content": "The dump is far from over, the party just started\n\nMy promised targets below 100k are loading",
      "timestamp": "Sep 22, 2025 · 10:29 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1970072896447160429#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1970059551996080490#m",
      "content": "#Bitcoin: A downside move of just 4% was enough to trigger the largest liquidations since the beginning of the year.  It proves what I told you days ago, the real liquidity sits below, not above. The herd is overexposed, and the herd is always wrong! My big short is printing",
      "timestamp": "Sep 22, 2025 · 9:36 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1970059551996080490#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1970052183002644483#m",
      "content": "In the next days you’ll watch your beloved bull poster flip bearish, and the clowns who promised you an altseason quietly vanish and go silent over night. The only thing screaming is your portfolio that is soon left with nothing",
      "timestamp": "Sep 22, 2025 · 9:06 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1970052183002644483#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1970027100611699119#m",
      "content": "Isn’t it fascinating that out of all the days since turning bearish last month, I chose yesterday to enter altcoin shorts? Indeed, another display of perfection in the world of dumb money.",
      "timestamp": "Sep 22, 2025 · 7:27 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1970027100611699119#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1970022076913484247#m",
      "content": "The entire market is now trapped. Apart from BTC and ETH, countless altcoin positions remain open. The liquidation cascade that started and what’s coming for altcoins will be nothing but legendary",
      "timestamp": "Sep 22, 2025 · 7:07 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1970022076913484247#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1970020236570345741#m",
      "content": "Imagine not having the DrProfit premium membership..",
      "timestamp": "Sep 22, 2025 · 7:00 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1970020236570345741#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969879726358479332#m",
      "content": "If you bought Stocks between August and today, your capital is swimming alongside grandma’s savings, your old teacher’s pension, and your taxi driver’s tip money. Retail has flooded the market with billions since August marking the highest inflows in over a year.",
      "timestamp": "Sep 21, 2025 · 9:41 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969879726358479332#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969875404665110659#m",
      "content": "Insiders have been unloading shares at record pace, with 95% of all insider transactions in the last 30 days entirely sell-driven. Meanwhile retail has been buying heavily since August, hitting the highest inflows in over a year\n\nSmart money distributes, the crowd buys the top",
      "timestamp": "Sep 21, 2025 · 9:24 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969875404665110659#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969808556934443219#m",
      "content": "Ever wonder why 70–80% of those “bullish” altcoin accounts with INSANE targets only show up when the altcoin market moves a little upward? They stayed silent for 2 years, then magically reappear at the first flash of green\n\nYou don’t believe it ? Check by your own",
      "timestamp": "Sep 21, 2025 · 4:58 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969808556934443219#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969807067398705292#m",
      "content": "Altcoins have finally entered my radar as prime short entries. Why chase pennies on the upside when you can easily take the liquidity when the market turns down\n\nToday I’m shorting alts for the first time since flipping bearish a month ago. Exact signals given in premium only",
      "timestamp": "Sep 21, 2025 · 4:52 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969807067398705292#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969765371029737754#m",
      "content": "No Sunday report today, all you need to know was given in the last two Sunday Reports. The market takes time to move. Have some patience and drink tea.",
      "timestamp": "Sep 21, 2025 · 2:07 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969765371029737754#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969764513244123365#m",
      "content": "Gave the $ETH buy set up at $2200 in June\n\nGave the first target of $4,800 - Took profits\n\nMore than 120% in two months is a great deal\n\nI am a simple man, buy low, selling high, repeat",
      "timestamp": "Sep 21, 2025 · 2:03 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969764513244123365#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969524600565301309#m",
      "content": "#Bitcoin summary from the 2022 bottom:\n\n2022: Everyone screamed 10k, few bought\n\n2023: Recession panic, crash calls everywhere\n\n2024: Bubble talk dominated, no conviction\n\n2025: Suddenly … pure euphoria after 100k",
      "timestamp": "Sep 20, 2025 · 10:10 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969524600565301309#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969524782719721594#m",
      "content": "More details: \n\n2022 – The entire market was scared to enter. Retails believed in 10k BTC and missed buying in time. Fear stayed until the end of the year and throughout 2023.\n\n2023 – Massive recession fear took over. Retails stayed bearish and kept calling for a biblical dump, with peak fear hitting during the Credit Suisse collapse.\n\n2024 – One full year moving sideways between 50–70k. After Japan’s summer crash, people called it a bubble and expected a sharp dump. Sentiment was at extreme lows before the breakout to 100k. Remember my box strategy back then in which I called for 120k!\n\n2025 – Suddenly, after 100k, everyone turned bullish. Recession fears vanished from retail minds, replaced by belief in endless upside.",
      "timestamp": "Sep 20, 2025 · 10:11 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969524782719721594#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969164396719968677#m",
      "content": "Market overview in last 24h:\n\n- Japan stock market opens 3% in red\n- Japan ready to unload $250bn in ETFs\n- Yields all over the world rising despite cut\n- JP Morgan calls for 50% market increase\n- Mortgage rate higher despite rate cuts\n- Uncertainty, because of Yields & Japan",
      "timestamp": "Sep 19, 2025 · 10:19 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969164396719968677#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969154622871704017#m",
      "content": "Ignore short term fluctuation price is back at entry. Drink tea and wait for the big move",
      "timestamp": "Sep 19, 2025 · 9:40 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969154622871704017#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969154069747879998#m",
      "content": "It’s the 20th altseason this cycle ?",
      "timestamp": "Sep 19, 2025 · 9:38 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969154069747879998#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1969021315555201519#m",
      "content": "Global bond markets are fully rejecting the Fed’s move. A rate cut on paper means nothing if yields keep climbing. The irony is your mortgage still gets more expensive",
      "timestamp": "Sep 19, 2025 · 12:50 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1969021315555201519#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1968756342434226676#m",
      "content": "#Bitcoin: Even if it moves to $500,000, the entire upside liquidity wouldn’t match what’s waiting below. The road to 90k holds 2.5x more liquidation blood than the ENTIRE market has above!",
      "timestamp": "Sep 18, 2025 · 7:17 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1968756342434226676#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1968670142704893975#m",
      "content": "The Market is sitting at historic resistance zones\n\nBTC at a 10-year historic resistance\nDow Jones at a resistance since 1899\nSPX at a 10-year resistance\nDXY sitting on 14-year support\n\nMarkets are BEARISH unless these walls break",
      "timestamp": "Sep 18, 2025 · 1:35 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1968670142704893975#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1968387315526680825#m",
      "content": "This is a VERY BEARISH speech so far by Powell",
      "timestamp": "Sep 17, 2025 · 6:51 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1968387315526680825#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1968385858098315414#m",
      "content": "Powell gives bulls a reality check as he speaks",
      "timestamp": "Sep 17, 2025 · 6:45 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1968385858098315414#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1968385223416250704#m",
      "content": "Trump going crazy listening to Powell right now",
      "timestamp": "Sep 17, 2025 · 6:43 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1968385223416250704#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1968329038323450092#m",
      "content": "The herd wakes up and realizes that 25bps is already priced into the markets. Congratulations on catching up with reality! Late as always! At this point, preparations should already be DONE! Prepared myself 30 days ago for this day! Holding zero spot, and fully in USDT/ Short",
      "timestamp": "Sep 17, 2025 · 2:59 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1968329038323450092#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1968236897945477381#m",
      "content": "Altseason is just bagholders praying new idiots buy their trash, recycling of stupidity, cycle after cycle",
      "timestamp": "Sep 17, 2025 · 8:53 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1968236897945477381#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1968234145831907649#m",
      "content": "When the crowd is dancing in euphoria, it starts to lose all perspective, not realising the floor is about to collapse!",
      "timestamp": "Sep 17, 2025 · 8:42 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1968234145831907649#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1967654917080007081#m",
      "content": "This is NOT the time to play long-term hero. BTC has pumped non-stop from 16k since Jan 2023. Thinking it goes vertical forever is delusional. Protect capital now. The big money is made buying the blood in the next cycle and not buying or holding at the top",
      "timestamp": "Sep 15, 2025 · 6:21 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1967654917080007081#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1967653766506877133#m",
      "content": "For those still fooled thinking the bull is “about to start” wake up. It started in Jan 2023. BTC has been moving up for 2 years and 8 months!\n\nIn 2015-2017 bull market lasted  820d\n2019-2021 bull market lasted 1004d\nCurrent \"bull market\" lasting 1035d..\n\nYou’re late!",
      "timestamp": "Sep 15, 2025 · 6:16 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1967653766506877133#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1967203158418968766#m",
      "content": "#Bitcoin – Stock Market What’s Next?\n\nThe Big Sunday Report: Everything You Need to Know\n\n🚩 TA / LCA / Psychological Breakdown:\n\nBitcoin:  The average retail entry price for longs and spot sits between 117k–122k, with most retail positions opened in the last 3 months. The majority of these entries are still underwater, sitting in loss, but short-term stress hasn’t broken them yet. Two weeks ago when BTC dropped to 107k we saw smaller panic sells and some longs closed in loss by retail, but not a significant realization of loss. Market makers know this. That’s why they continue to unload in the 115k–125k zone, aggressively but wisely, taking profits without leaving obvious footprints on the chart. Why else do you think we’ve been stuck in this sideways chop since July? Sideways markets usually speak two languages only, either accumulation or distribution! So lets answer this question wether the market is currently in an accumulation (Buying) or Distribution (Selling) market.\n\nTake it to the next step: how many retail players entered here, and how many institutions? How many retailers are taking profits? How many institutions? The truth is clear: whales are unloading BIG! Big holders with 1,000–10,000 BTC have sold $13B of BTC in the last 30 days, this is the largest whale sell-off since July 2022 at previous ATH levels! They dumped about 116,000 BTC in that period. Meanwhile, after strong inflows in July, Bitcoin spot ETF flows have slowed hard since early August down to approx. 500 BTC/day. That means less new capital, less absorption, and more profit-taking pressure. Yes, flows remain positive in places, but the intensity has is no longer there as we have seen during this cycle. Without consistent inflows, demand can’t match supply. That’s why the 115k–125k zone is nothing more than a massive profit-taking area for whales and big players. No matter how long we move in this zone, the big move after this zone is to the downside, and yet retail celebrates every revisit to 120k like it’s a victory, blind to the fact they’re cheering inside a distribution range. Even if BTC spikes again into 120–125k, those same people will celebrate, not realizing they’re being used as exit liquidity for bigger hands. I will continue to add shorts, and I’ll short more agressive if market allows to visit higher into 125k! Trade with DrProfit on BloFin: blofin.com/invite/DrProfitCr…\n\nI warned in early August: market makers would pump altcoins to distract while they sell BTC. That’s exactly what’s happening now. Alts rally, BTC dominance drops, greed explodes which is the perfect distraction. Yet people act surprised to see alts moving this strong. I told you this weeks ago, if it’s a quick trade with quick profit-taking, fine. But to believe this is the start of a real altseason is stupidity. The so-called “altcoin index” shows 78 out of 100 alts outperforming BTC, but most of this “strength” comes from newly listed, exchange-pumped coins with no coin history and no fundamentals! You dont believe it? See the highest gainers and you will find out these are coins you never heard about and existing since few days or weeks only!\n\nBTC funding is fairly neutral, slightly tilted long, but nothing extreme enough to force a squeeze. BTC also reclaimed the golden line, not because the market turned bullish, but because market makers want to manage sentiment, to keep fear out while they continue unloading above it. Our strategy remains the same: take profits only above 115k and enter shorts only in the 115k–125k range. Meanwhile altcoins are heavily in over-leveraged long, which makes the entire space dangerously fragile. Most of liquidity remains in the downside till the region of 90k! There is some small liquidity remaining in 117-118k but nothing compared to whats in the downside. Tons of liquidity starts from 106k, moves down till 90k!\n\nMy BTC position: As you can see on the chart, BTC is back in my short, sell zone, 115k–125k. Today I added the final 10% into USDT/shorts and closed out my entire spot positions. Profit-taking was a one month process as BTC barely moved inside the sell zone over the last 30 days. Now I stand 100% in Shorts/USDT, 0% Spot, 0% Stocks. All the take profit and short orders been executed between 115-125k! The only assets I hold are Gold & Silver.\n\nAnd now comes the big lie: in the coming days you’ll hear endless hype about $7.5T (** This content is only available for DrProfit premium members. Premium gives what free never will: daily market updates, trade signals, exact and detailed analysis, execution roadmaps, deep educational content, and real alpha you won’t find anywhere else. Join here: whop.com/drprofit-trading/)\n\nThe FOMC is about to cut 25bp, already priced in. What matters now is not the cut itself but what Powell says, because this time the cut is significant. I made it clear two weeks ago: this is the first real cut of the cycle where (** This content is only available for DrProfit premium members. Premium gives what free never will: daily market updates, trade signals, exact and detailed analysis, execution roadmaps, deep educational content, and real alpha you won’t find anywhere else. Join here: whop.com/drprofit-trading/)\n\nLook at the yields, exactly what I warned in my report. In 2024, yields crashed –16% into the Fed’s first cut. Markets rushed into bonds, betting on lower rates. That was (** This content is only available for DrProfit premium members. Premium gives what free never will: daily market updates, trade signals, exact and detailed analysis, execution roadmaps, deep educational content, and real alpha you won’t find anywhere else. Join here: whop.com/drprofit-trading/)\n\nAdd to this the worst job market in the history of the USA. Today’s numbers are a shock, and if inflation data in the coming days comes in worse, fear will spike violently. The only ones celebrating these cuts are retail gamblers. (** This content is only available for DrProfit premium members. Premium gives what free never will: daily market updates, trade signals, exact and detailed analysis, execution roadmaps, deep educational content, and real alpha you won’t find anywhere else. Join here: whop.com/drprofit-trading/)\n\nTrade with DrProfit on BloFin: blofin.com/invite/DrProfitCr…\n\nTHIS IS NOT FINANCIAL ADVICE BUT EDUCATIONAL CONTENT ONLY. ALL WRITTEN HERE IS MY OPINION AND MY OWN TRADING AND INVESTING STRATEGY",
      "timestamp": "Sep 14, 2025 · 12:25 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1967203158418968766#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1967152417214247226#m",
      "content": "From now on, the Sunday reports cover two\n\nBTC + Stock Market combined in one report\n\nSunday report is all you need to know",
      "timestamp": "Sep 14, 2025 · 9:04 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1967152417214247226#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1966759867923734726#m",
      "content": "I called the 68k top in 2021\n\nI called for 18k to be the bottom\n\nWe hit 18k with perfection and I bought\n\nBought at 18k with all profits from 68k\n\nNow at 115k I started to take profits again\n\nWill be buying much lower soon..",
      "timestamp": "Sep 13, 2025 · 7:04 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1966759867923734726#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1966759701233684690#m",
      "content": "Not everyone was given the wisdom and humbleness to be capable to buy Bitcoin at the absolute bottom at 16-18k. Indeed, DrProfit bought the absolute bottom!\n\nNow I’m more than happy to sell into the new entry of retails! Best of luck to you!",
      "timestamp": "Sep 13, 2025 · 7:03 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1966759701233684690#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1966520628057665565#m",
      "content": "No one speaks about the extreme spike in open interest and the over leveraged altcoin market right now. The last time we saw these open interest levels was December 2024, right before the correction from 108k to 90k region..",
      "timestamp": "Sep 12, 2025 · 3:13 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1966520628057665565#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1966421156975858076#m",
      "content": "Hey @grok \n\nWhat is @DrProfitCrypto accuracy rate in terms of Bitcoin predictions?",
      "timestamp": "Sep 12, 2025 · 8:38 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1966421156975858076#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1966418492732977524#m",
      "content": "Catch me if you can",
      "timestamp": "Sep 12, 2025 · 8:27 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1966418492732977524#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1966418116553908593#m",
      "content": "Bitcoin is now at the exact same price it was 3 weeks ago where I entered the last short at $115,200 region which is loacated in my short area. Every day Bitcoin moves in the range of 115-125k is adding more shorts!",
      "timestamp": "Sep 12, 2025 · 8:26 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1966418116553908593#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1966411587524145598#m",
      "content": "#Bitcoin is finally back in the sell/short zone,  time to take profits on BTC, ETH & alts spot bags, add to short! Every day in the sell zone = Taking 10% of bag position size and add into shorts! Current status is 80% USDT/ Short while 20% remains spot!",
      "timestamp": "Sep 12, 2025 · 8:00 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1966411587524145598#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1966060384948789568#m",
      "content": "Are you bullish or bearish for the next weeks?",
      "timestamp": "Sep 11, 2025 · 8:44 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1966060384948789568#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1966058000159805769#m",
      "content": "#Bitcoin: Big players and whale wallets are selling hard in the sell zone area I am speaking about since one month. Preparing to add more shorts if market allows to visit the sell zone area! Ignore noise and price fluctation as the big move is going to be in the downside!",
      "timestamp": "Sep 11, 2025 · 8:35 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1966058000159805769#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1965897838761853429#m",
      "content": "Target of 90-94k comes faster than you think. Market risk is maxed. First comes the 90-94k crash, what follows is early to tell now: either more downside or an explosive run to 120–140k. What’s next again is CLEAR: Recession crash in early 2026",
      "timestamp": "Sep 10, 2025 · 9:59 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1965897838761853429#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1965765909462556781#m",
      "content": "MACRO ECONOMY IS IN BIG DANGER!\n\nFirst and more importantly, no matter when the recession crash happens, either in the next weeks or in Q1-Q2 2026 as described below, the 90-94k Bitcoin target remains regardless!\n\nThe yield curve is one of the best leading indicators of the economy. It compares the interest paid on short-term US government bonds (2-year) with long-term bonds (10-year). Normally, long bonds pay more because you are lending for longer. That’s called a positive spread. When the opposite happens and short bonds pay more, it’s called an inversion. An inversion signals that investors expect trouble ahead and that the Fed will be forced to cut rates.\n\nThe yield curve (10Y–2Y) inverted on July 5, 2022 and stayed inverted for 784 days, the longest inversion in U.S. history. Every single recession of the last 50 years has been preceded by this signal. On Aug 27, 2024 the curve flipped back positive (+0.56%). History shows the crash comes ALWAYS after normalization, not during inversion. Same happened in 1990, 2001, 2007 and now most recently in 2024-2025.  Looking back at history, the lag between normalization and the start of a recession (Market Crash) was always short. In 1990, the recession began about 180 days after the curve turned positive. In 2001, it took only 60 days. In 2007, it was around 180 days again. So historically the lag has been in the 2–6 month range, but this cycle the inversion itself lasted much longer than any other cycle in history (784 days). The Fed already began cutting rates before a recession started, similar to what happened in 2001. The labor market is only now starting to weaken, with unemployment rising to 4.3% and job growth heavily revised down. So this time the clock is running much longer, 550–650 days but history still says the outcome is the same. A recessionary crash is coming, only with a bigger delay. So as per the calendar when should it start? We are now entering the high risk area in which the recession (Market crash) is going to hit the markets hard. Now, till Q2 2026 is high risk area and the big crash is going to happen in this timeline.  On top of it Bond market SCREAMS HIGH RISK: 10Y \\~4.05%, 2Y \\~3.47%. Falling yields + positive spread are not bullish. This is exactly what we saw before 2001 and 2007 crashes, “back to normal” that was actually the calm before the storm.\n\nMy Position\n\nThe last post about the Inversion/ Positive spread recession indicator is one more confirming indicator for the big downside move and many of you missed the MAIN point. The next decisive move is BTC tagging 90–94K. The plan has not changed and I’ve said it for a month: sell 10% of spot daily into strength and load shorts whenever the market offers the 115–125K distribution zone. Because price slipped below our main short window, we’ve already executed 70% capital sits in USDT/shorts, and the remaining 30% spot is waiting for a retest of the short zone to unload and add even more shorts.\n\nThat playbook is crystal clear. What happens after 90–94K? It’s too early to tell for now: either we print 90K and MOVE TOWARDS 140K before the recession crash, or the recession crash starts in the coming weeks, both events are highly likely and its early to tell. Again, 90-94k region is clear and this has to come. 90–94K gets hit. From there, depending on sentiment and short‑term signals, we either take the tactical 90K → 140K ride or sit tight in a very profitable short for lower targets if recession fear increases. Do not confuse the 90K correction with the recession leg, they are different events. 90K is coming regardless! If the crash timing is early–mid 2026, there’s room from 90K toward 140K before the top and the recession crash. \n\nThese are the following scenarions:\n\n1. BTC will continue in its \"Short area range\", later on dump to 90–94K\n\n2. A major recessionary crash, think 1990/2001/2008 is ahead. Timing risk is at max now and extends through June 2026. Even on a 90K bounce, any long we take will be treated as high‑risk and managed with high risk management, because I’m 99% confident the crash lands between now and Q2 2026. \n\nI hope that makes it clear !",
      "timestamp": "Sep 10, 2025 · 1:14 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1965765909462556781#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1965759801490915758#m",
      "content": "Everything between 115-125k is SHORT AREA\n\nAll my shorts I hold been entered in this area!\n\nPlanning to add more if market allows to visit!",
      "timestamp": "Sep 10, 2025 · 12:50 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1965759801490915758#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1965438420911833253#m",
      "content": "In the entire history of the USA we currently have the WORST JOB MARKET! Today’s numbers are a shock to the market! Fear will increase if inflation numbers will be worse in coming days",
      "timestamp": "Sep 9, 2025 · 3:33 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1965438420911833253#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1965168814515257830#m",
      "content": "Altcoin Warning:\n\nIn the Sunday Report one month ago, at 117K, I made the decisive call to turn bearish. I explicitly warned that market makers would push altcoins higher in the following days and weeks to create a perfect illusion for retail. What we’re seeing now is exactly that: a manufactured altcoin rally designed to trap late buyers while the real money quietly exits. It’s the oldest play in the book, distract retail with shiny pumps while the distribution phase unfolds at the top. Do not be fooled. This is not an “altseason.” It is a short lived exit pump, nothing more. The retail crowd will celebrate too early, only to realize too late that they were nothing but the exit liquidity in a heavy leveraged altcoin market.\n\nRight now, retail are blindly FOMOing into alts while ignoring the macro risks staring them in the face: PPI on Wednesday, CPI on Thursday, and the FOMC just eight days away. It only takes a distraction to set up the real move. If Bitcoin were about to start a new leg up, we would see fear driven headlines and FUD campaigns just like in previous cycles. But this time, there’s nothing of that scale, again: NOTHING OF THAT SCALE! Instead, the distraction is different: pure greed. Fear fuels upside moves. Greed sets the stage for downside, and what better way to manufacture greed than a staged altcoin rally?",
      "timestamp": "Sep 8, 2025 · 9:42 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1965168814515257830#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1965163348095582563#m",
      "content": "$BTC: Last month I decided to go big on shorts. Took profits and went into shorts in the mentioned short area. The short area ranges from 115-125k (8% Range). If market allows to visit the short area again I will add more shorts. Drink tea and waiting for the big move",
      "timestamp": "Sep 8, 2025 · 9:20 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1965163348095582563#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1965160914963030319#m",
      "content": "#Bitcoin has now been in a distribution phase for over two months. When its not accumulation (Buying), its distribution (Selling). This heavy unloading happens in the 115K–125K region, the local top. Whales and fresh unlocked addresses CLEARLY dumping into pumps",
      "timestamp": "Sep 8, 2025 · 9:10 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1965160914963030319#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1964683878876250370#m",
      "content": "#Bitcoin: No Sunday Report today. The last two reports already laid out EVERYTHING you need to know. But one critical shift must be addressed: the golden line is gone + Retest. Its breakdown CONFIRMS the bearish thesis and is just one more confirmed bearish indicator.",
      "timestamp": "Sep 7, 2025 · 1:35 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1964683878876250370#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1964601464137109932#m",
      "content": "NVIDIA CEO continues to sell his stock\n\nScheduled sales are increasing in September\n\nInsiders know something..",
      "timestamp": "Sep 7, 2025 · 8:07 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1964601464137109932#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1964169621281657071#m",
      "content": "🚨MICROSOFT CEO SELLING BIG!\n\nSatya Nadella DUMPS $75M MSFT, 15% of his bag in ONE shot. Last time he sold this big was Nov 2021, the exact TOP!",
      "timestamp": "Sep 6, 2025 · 3:31 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1964169621281657071#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1963946328582426859#m",
      "content": "There is always time to buy big\n\nAnd there is always time to take profits\n\nAfter a 600% BTC move it’s time to sell",
      "timestamp": "Sep 5, 2025 · 12:44 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1963946328582426859#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1963904003667820549#m",
      "content": "#BTC: I understand the euphoria of the bulls over a small pump, I would be happy too if my bags see a very small relief after weeks of decline. My strategy remains the same, adding 10% of size daily if market allows to visit back the 8% range of short area!",
      "timestamp": "Sep 5, 2025 · 9:56 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1963904003667820549#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1963599108930986349#m",
      "content": "My bearish stance just became more agressive\n\nI said after hitting 90-95k we can see a new ATH\n\nThis is now invalid. I consider lower as possible\n\nIn other words, there is nothing to be bullish",
      "timestamp": "Sep 4, 2025 · 1:44 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1963599108930986349#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1963564990230679961#m",
      "content": "More than 400 insider trades in two weeks\n\nOnly two of them are a buy, all others are sell\n\nInsiders continue to take profits this week.",
      "timestamp": "Sep 4, 2025 · 11:29 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1963564990230679961#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1963507684000309597#m",
      "content": "We have too many existing marriages between bags and owners, some bags are even older than some wife’s, and yet some people not thinking about a divorce ?\n\nAnd the worst, 90% of bags are in profits",
      "timestamp": "Sep 4, 2025 · 7:41 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1963507684000309597#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1963159649110077648#m",
      "content": "Interesting chart BTC/GOLD, still no ATH yet for Bitcoin against Gold! While BTC managed to see a new ATH recently against the USD, it failed to do so against Gold",
      "timestamp": "Sep 3, 2025 · 8:38 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1963159649110077648#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1962992687235400012#m",
      "content": "The market is extremely Bearish!\n\n2024: Yields crashed -16% in weeks before the Fed’s first cut. Markets rushed into bonds, betting big on lower rates. —> Effect is Bullish!\n\n2025: Yields are rising +5% into the next cut. Investors are dumping bonds, demanding higher payback to lend money. —> Effect is Bearish!\n\nThis is dangerous. Imagine your credit card company telling you “we lowered your rate,” but the bank suddenly doubles the cost of your mortgage. That’s what’s happening: the Fed cuts short rates, but long-term borrowing is getting more expensive. It means the Fed has lost control. The government pays more, companies pay more, and even households pay more.\n\nThe only ones believing in a positive effect of the rate cuts are retails, the Fed is cutting, but markets don’t believe it will fix anything. Big players are rushing into yields, demanding higher returns! This is what I said weeks ago. The significance of a rate cut can be seen through the uncertainty and the different opinions regarding the FED decision. \n\nWhile everyone watches only at the stock market, people forget the Yield/ Bond markets. This brings me to the conclusion that big players are positioning in a very bearish stance towards the next rate cut.",
      "timestamp": "Sep 2, 2025 · 9:35 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1962992687235400012#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1962188519197057200#m",
      "content": "Everyone knows rate cuts are coming\n\nAnd yet market reacted that weak?\n\nIts already a priced in event\n\nSell the news!",
      "timestamp": "Aug 31, 2025 · 4:19 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1962188519197057200#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1962185070350938607#m",
      "content": "#Bitcoin – What’s Next?\n\nThe Big Sunday Report: Everything You Need to Know\n\n🚩 TA / LCA / Psychological Breakdown:  This Sunday report is a direct follow-up to last week’s edition. At $116k, I made it very clear: I started to take profits and scale into shorts step by step. One week later, Bitcoin is already down 8%, exactly as anticipated and the coming weeks will be far more brutal. Last week’s Sunday report remain intact, so if you haven’t studied that report, do it. Ignorance is not an excuse when the market is about to punish. This week the focus is on short-term holders wallets between 1 to 6 months. Their cost bases are:\n\n1M holders: $115.6k\n3M holders: $113.6k\n6M holders: ~$107k\n\nBitcoin trades beneath all these levels. That means every recent buyer is already in the red. But don’t mistake this for fear there is no panic yet. These investors haven’t tasted enough fear yet. That is why market makers will drag this market lower until real capitulation begins. The $107k–$108.9k zone is the last strong line. Once it breaks, we will move into $90k–$95k. But even that is just the opening act. Why? Because right now unrealized loss sits at a laughable 0.5%. Compare that to 30%+ in real corrections. Zero panic, zero capitulation, zero fear. Market makers are starving for those losses. They won’t stop until 10–20% of the market is underwater and panic selling hits. That aligns with my $90k–$94k target and September will likely deliver it. Let’s be clear: the market has only corrected ~10% off ATH. Historically, bull markets saw 25% pullbacks minimum. This so-called “dip” is weak. Holders are still too comfortable. The game is not to reward comfort but to break the weak hands and let them selling in panic and fear. Despite the “Fear” reading on the index, there is not enough realized loss. Expect the market makers to apply pressure until short-term traders are forced to sell their bags at a loss and everyone in the most powerful and biggest existing trading group on the planet knows exactly what that means. Our multi-year plan is on track, join premium ($59 / Month)  to know more👉 whop.com/drprofit-trading/\n\nStock market insiders are selling!\nLast week in stock market we witnessed something very interesting: over 200 insider trades hit the market, and NOT A SINGLE ONE was a buy. Not one. Every insider screamed the same word: SELL! Ask yourself: why are corporate insiders dumping stock at this pace? What do they see that the retail herd refuses to see? These are the people with access to the numbers before anyone else and they are not betting on upside. This warning aligns perfectly with Bitcoin’s fragile structure. If insiders are unloading stocks into strength, don’t be surprised when the same wave of selling pressure carries over into crypto.\n\nThe market is not in fear yet. It is not in capitulation yet. It is still in denial. That’s why the real pain is coming. September will not be kind for most of holders. This is an update for the last weeks Sunday report, make sure to read the report from last week.\n\nTrade with DrProfit on BloFin: blofin.com/invite/DrProfitCr…\n \n⚠️ Disclaimer: This report is for educational purposes only. It does not constitute investment advice. You are solely responsible for your financial decisions.",
      "timestamp": "Aug 31, 2025 · 4:05 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1962185070350938607#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1961904081108439245#m",
      "content": "People reading this now think it’s a good time to buy now, based on the word ‚Strongest Altcoin‘. How many months have I begged to buy between 0.30 and 0.50?\n\nHow often have I praised XRP and promised a bright future?\n\nFew.",
      "timestamp": "Aug 30, 2025 · 9:29 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1961904081108439245#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1961903747082158256#m",
      "content": "Strongest altcoin from top 20 coins per market cap YTD/YTD is $XRP with an increase of 396%, beating most of other altcoins in increase!\n\nNo other coin comes close to XRP! The second strongest alt coin is SUI with 297%! The most hated altcoin gave the strongest results!",
      "timestamp": "Aug 30, 2025 · 9:27 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1961903747082158256#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1961531434381840822#m",
      "content": "$BTC: In 2021 BTC flashed a bearish divergence right before the brutal bear market started. Today, the charts scream the same warning again! Bearish divergences on the weekly chart! I don’t usually put too much weight on divergences, but worth to consider!",
      "timestamp": "Aug 29, 2025 · 8:48 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1961531434381840822#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1961516689373147364#m",
      "content": "Stock market insiders are selling big!\n\nSame for Crypto whales & insiders..",
      "timestamp": "Aug 29, 2025 · 7:49 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1961516689373147364#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1961514917774627104#m",
      "content": "❗️INSIDERS ARE SCREAMING SELL!\n\nLast week over 200 insider trades hit the market, and not a single one was a buy. Every single insider is screaming the same word: SELL!",
      "timestamp": "Aug 29, 2025 · 7:42 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1961514917774627104#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1961492810537845094#m",
      "content": "The promised BTC dump below 100k is loading and can be expected in the promised month of September. Everything is going as planned\n\nCongratulation for those who sold and shorted the top with me 🤝",
      "timestamp": "Aug 29, 2025 · 6:15 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1961492810537845094#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1961452121573720348#m",
      "content": "Are you not entertained yet ?",
      "timestamp": "Aug 29, 2025 · 3:33 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1961452121573720348#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1961354936169402863#m",
      "content": "September has not started yet\n\nIt’s only the preparation ⏳",
      "timestamp": "Aug 29, 2025 · 9:07 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1961354936169402863#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1961348459073564741#m",
      "content": "Big silence from Bulls on X\n\nWhere are those accounts with hundreds of thousands of followers who laughed at my sell and short posts? They were loud before, but now they’re quiet. Once again, DrProfit was right, the cycle in exposing these clowns continues forever",
      "timestamp": "Aug 29, 2025 · 8:41 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1961348459073564741#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1961339326962303332#m",
      "content": "#Bitcoin: For months I spoke about the importance of the Golden Line, every bounce came right at the golden line confirming my prediction. This time I didn’t even mention it, because the break was obvious. Now BTC has lost the Golden Line. Extremely bearish signal!",
      "timestamp": "Aug 29, 2025 · 8:05 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1961339326962303332#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1961004063572513098#m",
      "content": "🚨 Most of crypto investors are in profit\n\n90% of all BTC investors are in profit\n98% of all ETH investors are in profit\n92% of all XRP investors are in profit\n100% of all BNB investors are in profit\n\nThere is too much profit in the markets!",
      "timestamp": "Aug 28, 2025 · 9:52 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1961004063572513098#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1960996676610535934#m",
      "content": "#Bitcoin: We started building shorts last week in the $117K–$115K range, adding 10% daily over 10 days. BTC is still outside our short/sell zone. If price returns to our short box, we’ll keep stacking 10% daily until the area is fully loaded. Till then, enjoy your profits!",
      "timestamp": "Aug 28, 2025 · 9:23 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1960996676610535934#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1960616568552878497#m",
      "content": "Extremely bullish on all of markets \n\nOne strong correction is loading\n\nBig and golden times afterwards",
      "timestamp": "Aug 27, 2025 · 8:13 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1960616568552878497#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1960073499319672968#m",
      "content": "Still early to celebrate \n\nMore beautiful days coming \n\nThank you for your understanding",
      "timestamp": "Aug 25, 2025 · 8:15 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1960073499319672968#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959930543920804079#m",
      "content": "Bad day for bulls and yet nothing compared for what’s coming soon..",
      "timestamp": "Aug 25, 2025 · 10:47 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959930543920804079#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959849577127035023#m",
      "content": "The whale that sold 24,000 Bitcoin at market price has most likely read the Sunday report, panicked and decided to sell big\n\nHe still holds 150,000 BTC!",
      "timestamp": "Aug 25, 2025 · 5:25 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959849577127035023#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959661372884893855#m",
      "content": "Some people find it difficult to believe that I made some insane predictions such as calling 18k when BTC was at 68k in 2021. Wait till they find out I called The FTX or Luna crash few days in advance and even wrote a full report about warning all? Or the 100k call?\n\nA lot..",
      "timestamp": "Aug 24, 2025 · 4:57 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959661372884893855#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959658990276591623#m",
      "content": "Called the crash from 68k in 2021\n\nSaid it will go to 16-18k at ATH in 2021\n\nCalled 16k the bottom once we hit\n\nAt 16k I said bull started, target of 100k is loading\n\nAt 100k I said the bull is not over 150k is loading\n\nSoon we see a correction, 150k afterwards",
      "timestamp": "Aug 24, 2025 · 4:48 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959658990276591623#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959656167971463566#m",
      "content": "#Bitcoin – What’s Next?\n\nThe Big Macro Report: Everything You Need to Know\n\n🚩 TA / LCA / Psychological Breakdown:\n\nThis report speaks about the current market status and what to expect in the coming weeks, especially in the month of September. We all know the fools that never took profits. We all know those who have been holding from cycle to cycle and never realized any kind of profit. Beware of this kind of human nature, and beware of the risks of selling in fear. There is no better feeling than selling with euphoria, in big profit, and after a clear and executed plan that played out, Indeed we follow our path of buying low and selling high. In order to keep the momentum of greed and euphoria, the market makers need to create a bullish sentiment with leveraged, manipulated prices to keep momentum high. To trap as many retails as possible, it’s also likely that market makers will start moving up altcoins more aggressively in the coming days, just to bring as many retails as possible to the honey pot. \n\nThe FED decision in September:\n\nEvery big player and serious investor knows that once the FED starts cutting rates, we usually see a strong correction afterwards. In my opinion, the September meeting can and should be considered as the first significant rate cut, given current market events. It’s the most important one compared to the last cut since 2020 in September 2024, which showed no signs of correction. Back then, people were calling for a strong pullback, while I said clearly that the September 2024 cut was not significant at all, and I was proven correct. In terms of market understanding, such a FED pivot is considered a soft landing, followed with consolidation and stabilization, which the FED indeed managed to achieve. My prediction then proved more than correct, ignoring all the garbage talk about stocks and crypto that the markets are “always” dropping after the first cut. That is simply not true. The real drop happens only after the first SIGNIFICANT cut, when uncertainty kicks in and opinions split. That is why this cut is completely different, and why it will lead to a strong correction in stocks and crypto. Don’t compare this cycle to others or to other emergency cuts; each rate cut is unique and should be analyzed on its own terms. I strongly believe that this rate cut will play a key role in the market correction that will take place in September. The next FOMC meeting is set on 17th of September.\n\nBitcoin price Analysis:\n\nNow, in terms of charts, Bitcoin is very bearish because we still have a strong CME gap in the 93k area that needs to be filled. At the same time, most liquidity is sitting in the 90–95k region. We also need to retest the EMA50 weekly again. Overall, the chart is pointing strongly to my mentioned 93–95k region. Once again, we see a double top, once again volume is dropping hard, and the most recent pump was led by futures rather than spot buys. The chart is ready for a correction. Add to that many bearish divergences on both the daily and weekly chart, and the picture is clear. On top of this we need to focus on market psychology.  the retail side, which is even more important.\n\nAs you can see in the chart, I pointed out where retails sold and where they bought. This data is obtained from on-chain metrics, market sentiment, and the Fear & Greed Index, combined with bigger and smaller wallet flows. We can clearly see how retails always sell low and buy high. Most significantly, look at the latest dip in June from 110k to 98k. During that dip, it is clear that most of the spot buyers (95% of wallets) were big players and investors. Retail fully missed this move. The BIG wallets BOUGHT up to 110k, and retail didn’t touch anything until prices already climbed. Their latest entries are between 110 115k and even higher in the region of 120k+. As always, in order to shake them out, to let the weak hands sell lower than they bought , prices need to drop to their liquidation and max pain zone, which is the 90–95k region. This is one of the strongest sentiment signals we have to determine direction: as long as retail entered heavy, especially at these levels, the market needs to flush them out before the next leg higher. And this fits perfectly with the current narrative of rate cuts, a bull trap, and manufactured optimism. Let them believe in a “beautiful long-lasting alt season.” Good luck with those dreams. Wake up to reality. The trap is set: euphoria, endless expectations, and blind trust in authority (the FED). Combine all of this and what you get is a fake bullish sentiment. The best time to take massive profits, is exactly when retails are buying. The liquidity is being unloaded right now. unnoticed because tons of retails are rushing in at this moment while bigger wallets and even the BlackRock ETFs see no kind of strong inflows but rather outflows are dominating and everyone in the most powerful and biggest existing trading group on the planet knows exactly what that means. Our multi-year plan is on track, join premium ($59 / Month)  to know more👉whop.com/drprofit-trading/\n\nThe Strategy: \n\nI’ve spoken about our Strategy several times, but to execute it with perfection we must consider last week’s Sunday report, which outlined the range we are moving in. This range is the SHORT AREA and anything inside it is a short entry for me. The short area is shown in the chart as well! For that, position size matters. Since August 18th, I’ve been taking daily profits of 10% from all my bags, including ETH and BTC. For example, if my bag is $1,000, I take $100 profit each day and roll it into building a short position. This step-by-step accumulation of shorts and distribution of spot should only happen within the MENTIONED short area. Its important to mention that the short position only includes BTC and does not include ETH or any other altcoin. One month ago, I shared ETH at $2,600, and earlier buy signals at $1,800 and $2,000. I predicted ETH would hit $4,800 and a new ATH and it delivered with perfection. Now I’m taking profits step by step to buy back lower. After the September correction, I expect ETH to run to $7,000–$8,000 and Bitcoin to push toward $145,000–$150,000. The goal of this trade is simple: end up with more coins than we hold now by selling high and buying low. I play this game for the mid-term, not the very short term. My leverage is at x5, and my position is not yet fully loaded with four more days to go. Currently, Cash + Shorts make up 60%, while Spot bags are 40%. Each day I shift 10% from Spot into Shorts. I expect this trade to unfold in September. I don’t believe we’ll see the big move in the next few days unless something unforeseen happens, which would still work in our favor. If the market pushes higher, even into the $124,000 range, it remains inside the short zone. Should we reach that level, I will become even more aggressive, adding more than 10% to Shorts. I’ll update if the market allows us to visit that area within our range. Remember: market makers will do everything in their power to make the market appear strong right now. I use that manipulation to position for the real move that’s coming. The best example is the most recent pump that happened right after the Powell speech. Fully leveraged pump with no real spot demand. Dangerous.\n\nTrade with DrProfit on BloFin: blofin.com/invite/DrProfitCr…\n\nTHIS IS NOT FINANCIAL ADVICE BUT EDUCATIONAL CONTENT ONLY. ALL WRITTEN HERE IS MY OPINION AND MY OWN TRADING AND INVESTING STRATEGY.",
      "timestamp": "Aug 24, 2025 · 4:36 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959656167971463566#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959600534744088923#m",
      "content": "Targets after September correction ⏳\n\nBTC --> 145-150k\nETH --> 7-8k \n\nFirst we see a downside move, then up!",
      "timestamp": "Aug 24, 2025 · 12:55 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959600534744088923#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959596660541252004#m",
      "content": "Sunday report is ready\n\nIts a full September report\n\nThis requires 7000 likes to post",
      "timestamp": "Aug 24, 2025 · 12:40 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959596660541252004#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959209533844189349#m",
      "content": "#ETH is up over 100% after one month\n\nNow is a good time - Realise BIG profits!\n\nGave you ETH to buy low, and now sell high\n\nMany will regret in the next weeks..",
      "timestamp": "Aug 23, 2025 · 11:02 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959209533844189349#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959208091989442873#m",
      "content": "Tomorrow Sunday report\n\nIt will be a Special report\n\nWe can call it September report..",
      "timestamp": "Aug 23, 2025 · 10:56 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959208091989442873#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959148433861685454#m",
      "content": "Every day we add another 10% of short and taking profit on another 10% of position size. The entire position will be ready by 28th of August, perfectly in time before September starts. Expecting Bitcoin to breakdown from its current range in September. Maximum leverage x5",
      "timestamp": "Aug 23, 2025 · 6:59 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959148433861685454#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959147957623955925#m",
      "content": "Good morning Day Five ✅\n\nAverage Short Entry: $115,050\n\n- BTC to remain in existing range\n- BTC to breakdown in September\n- Daily 10% spot reduction goes on\n- Daily 10% short accumulation\n- Preparing empty bags by 28th\n\nCurrent Status:\n\n-50% in USDT & Short\n-50% in BTC & Alts",
      "timestamp": "Aug 23, 2025 · 6:57 AM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959147957623955925#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959025574829006919#m",
      "content": "The market is very beautiful right now\n\nBeautiful to realise VERY BIG profits!\n\nSell in beautiful times, buy in scary times",
      "timestamp": "Aug 22, 2025 · 10:51 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959025574829006919#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959024342773199162#m",
      "content": "My Strategy is very simple but effective\n\nFor 10 days I sell 10% of bags size\nFor 10 days I enter short with 10%\nAfter 10 Days my bags are empty\nAfter 10 days fully in a short position\n\nPreperations running for September! My Strategy will play out with perfection once again!",
      "timestamp": "Aug 22, 2025 · 10:46 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959024342773199162#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959021518677221550#m",
      "content": "Seems like people hate taking profits\n\nThey prefer their portfolio growing non stop\n\nI sell high and buy low, see my latest trades\n\nBeware of arrogance and greed, it kills you",
      "timestamp": "Aug 22, 2025 · 10:35 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959021518677221550#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959020723910897832#m",
      "content": "The last buy signal for #ETH was shared a month and half ago at $2,600. Please dont cry if I start realizing profits (10% bag size daily) after a 90% pump in less than one and half months! I prefer to take profits here\n\nThank you for your understanding",
      "timestamp": "Aug 22, 2025 · 10:31 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959020723910897832#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1959017858345685088#m",
      "content": "$ETH HITS MY TARGET OF $4,800\n\nINDEED, WE HIT A NEW ATH FOR ETH\n\nWE CONTINUE THIS MOVE TILL SEPTEMBER",
      "timestamp": "Aug 22, 2025 · 10:20 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1959017858345685088#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1958919286141153657#m",
      "content": "Yet you haven’t heard any reasons why I’m bearish short term. Timing is key. I could have told you in last Sunday report, but again, timing is key.. \n\nSmall Hint:\n\n-Retail inflows\n-Liquidity area\n-Priced in events\n-Whale Wallets\n-CME GAP\n-Retest of X\n-And more..",
      "timestamp": "Aug 22, 2025 · 3:48 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1958919286141153657#m",
      "author": "DrProfitCrypto"
    },
    {
      "id": "1958906644701569299#m",
      "content": "Repeat after me:\n\nBitcoin goes below 100k in September\nBitcoin goes below 100k in September\nBitcoin goes below 100k in September\nBitcoin goes below 100k in September\nBitcoin goes below 100k in September\nBitcoin goes below 100k in September",
      "timestamp": "Aug 22, 2025 · 2:58 PM UTC",
      "url": "https://twitter.com/DrProfitCrypto/status/1958906644701569299#m",
      "author": "DrProfitCrypto"
    }
  ],
  "meta": {
    "capturedAt": "2025-10-20T23:28:15.666Z",
    "tweetLimit": 200,
    "tweetsFetched": 200,
    "pagesFetched": 12,
    "sourceFile": "twitter-Following-1760964620895.json",
    "durationMs": 27788,
    "cursorTrail": [
      "DAAHCgABG3vZkwb__-wLAAIAAAATMTk3OTA3NDczNjQyNTcwMTQwOAgAAwAAAAIAAA",
      "DAAHCgABG3vZkwb__9wLAAIAAAATMTk3ODA0ODE4OTIxMjMyODI2MggAAwAAAAIAAA",
      "DAAHCgABG3vZkwb__8kLAAIAAAATMTk3Njc3NjMzNjEyNDY1ODE1MQgAAwAAAAIAAA",
      "DAAHCgABG3vZkwb__7ULAAIAAAATMTk3NDg5NzQ4MTQ0MDcxOTAwNwgAAwAAAAIAAA",
      "DAAHCgABG3vZkwb__6MLAAIAAAATMTk3MjI5OTEyMTE1NjYwNDE2OAgAAwAAAAIAAA",
      "DAAHCgABG3vZkwb__5ELAAIAAAATMTk3MTE4MjYxNDc1ODQ0OTQ0MggAAwAAAAIAAA",
      "DAAHCgABG3vZkwb__3wLAAIAAAATMTk2OTc1MTA1ODE2MDE2NTIxOAgAAwAAAAIAAA",
      "DAAHCgABG3vZkwb__2gLAAIAAAATMTk2NzE1MjQxNzIxNDI0NzIyNggAAwAAAAIAAA",
      "DAAHCgABG3vZkwb__1QLAAIAAAATMTk2NDE2OTYyMTI4MTY1NzA3MQgAAwAAAAIAAA",
      "DAAHCgABG3vZkwb__0ILAAIAAAATMTk2MTQ1MjEyMTU3MzcyMDM0OAgAAwAAAAIAAA",
      "DAAHCgABG3vZkwb__y4LAAIAAAATMTk1OTAyNTU3NDgyOTAwNjkxOQgAAwAAAAIAAA"
    ],
    "attempts": 1,
    "skipped": false
  }
}